[
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308518/Lightning-rod-copper-wiring-worth-100000-stolen-from-Po-Lam-Station-roof",
    "headline": "Lightning rod copper wiring worth $100,000 stolen from Po Lam Station roof",
    "date": "2025-08-07T21:34:30.000+0800",
    "body": "Police are investigating the theft of approximately HK$100,000 worth of copper wiring from lightning rods atop the Po Lam MTR station in Tseung Kwan O.\n\nOfficers responded to a report from station staff at 3pm today after discovering the missing components.\n\nAbout 300 meters of lightning protection strip are believed to have been stolen from both the lower platform and first-floor platform areas.\n\nIt is understood that both platform areas were secured with locked access points, making them inaccessible to the general public.\n\nThe case has been classified as theft and assigned to the Tseung Kwan O police district for further investigation. No arrests have been made at this time.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/89a3a55ac4b4354718d914c6ee99ab0c/2025-08/KakaoTalk_20250722_135229269_02.jpg",
    "sponsored": false,
    "id": "0ae5df87b11e4c80"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308532/Future-HK-Living",
    "headline": "Future HK Living",
    "date": "2025-08-08T09:00:27.000+0800",
    "body": "In a compact city like Hong Kong, creating sustainable and liveable spaces revolves around comfort, convenience, happiness and quality of life. It requires expertise in commercial revitalisation, placemaking, ecological conservation, technological innovation, and fostering care within the community.\n\nThese topics are explored in an exhibition themed “People make Places: the Making of Liveable Spaces” at Link Sustainability Lab in Lok Fu. Complete with a 270-degree immersive experience zone plus interactive games, the exhibition details how Hong Kong’s livable communities have been shaped by Link Asset Management over the past two decades and marks the 20th anniversary of Link REIT’s IPO.\n\nVisitors can learn more about the transformation of Hong Kong’s wet markets and use augmented reality (AR) filters to decode elements of change. They can even turn themselves into market stall owners for photo opportunities and chat with virtual fruit stall owner “Keung Gor” and virtual seafood stall owner “Lin Jeh”!\n\nAt the interactive game zone, visitors can check out the old and new looks of their favourite malls in the “Out with the Old, In with the New” interactive game. This exciting game requires visitors to complete a puzzle within a time limit to see how renovated shopping malls have transformed their communities. Meanwhile, the “Hoop Hero Challenge” brings visitors to experience the fun of shooting hoops with increasing levels of difficulty in the basketball courts of different districts.\n\nLooking ahead, the cities of the future would need our input. Visitors are invited to grab a brush to co-create liveable spaces using their creativity. Newly-commissioned artistic interpretations of “Future City” by United Kingdom artist Emily Allchurch and local artists Michelle Fung and Mimi Luk are also featured.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/31316fd99ae4dea8a8a5b53db057fcf0/2025-08/1_-_2025-08-08T085536_979.jpg",
    "sponsored": false,
    "id": "f019d688bae39685"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308517/Politicians-call-for-CCTV-to-curb-dog-waste-problem",
    "headline": "Politicians call for CCTV to curb dog waste problem",
    "date": "2025-08-07T21:27:37.000+0800",
    "body": "Hong Kong should install security cameras to tackle pet owners who fail to clean up after their dogs, the Democratic Alliance for the Betterment and Progress of Hong Kong has proposed.\n\nThe Central and Western district politicians also urged improvements to existing dog latrines and proposed using natural fresheners like lemon extract to combat lingering odors and stains from pet waste on city streets.\n\nIn a press conference yesterday, district councilor Rex Ip Yik-nam said the DAB received over 100 complaints about dog excreta fouling public places, with most concentrated in Caine Road, Conduit Road, Robinson Road, Ladder Street and Shing Wong Street.\n\nIp suggested targeted measures at dog waste black spots, including installing CCTV cameras, putting warning signs as well as increasing patrols, in order to deter “uncivilized” pet owners.\n\nHe also noted residents' complaints about lingering pet waste odors in summer, even one to two days after street cleaning, and proposed using natural, non-toxic deodorizers like lemon extract, in street rinsing exercises.\n\nDistrict councilor Noel Shih said the design of dog latrines can be improved. For example, replacing sand with a drainable stainless steel surface, and adding water facets. More dog excreta collection bins or latrines are needed in the area too, he added.\n\nDistrict councilor Yeung Hok-ming proposed adding more pet-friendly parks. He revealed that authorities plan to add pet facilities to Caine Lane Garden after the party’s survey found that about 300 of 400 interviewed residents voiced support.\n\nLawmaker Chan Hok-fung, who represents Hong Kong Island West, said the proposals aimed to foster a friendly community environment for both residents and the increasing number of pets in the district.\n\nThe government took enforcement actions against 24 cases of fouling of streets or public places by dog faeces in 2024, imposing a total of HK$70,000 fines, an official reply to lawmakers’ questions in June showed.\n\nOfficials indicated then they had no plans to amend the legislation to regulate dog urination in streets or public places, as rinsing those spots with sufficient clean water is enough for avoiding hygiene problems.\n\nAuthorities pledged to continue to promote the message of \"be a responsible pet owner\" to the public and educate dog walkers to properly clean up after their dogs through various channels, including posters, pamphlets, thematic websites.\n\n(Jamie Liu)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/b1ef710bab8f95c6c041c98881ad5604/2025-08/pet-_singtao_FILE_pet_dogs.jpg",
    "sponsored": false,
    "id": "513f82efba70f521"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308513/Education-Bureau-warns-over-mainland-tutoring-centers-DSE-program-at-local-school",
    "headline": "Education Bureau warns over mainland tutoring center's DSE program at local school",
    "date": "2025-08-07T20:32:40.000+0800",
    "body": "Phoebe Poon\n\nA mainland tutoring center claims to be partnering with Tsung Tsin Middle School in Cheung Sha Wan to offer the Hong Kong Diploma of Secondary Education Examination (HKDSE) program to Form 4 and Form 5 students, leading the Education Bureau to warn of potential scam.\n\nIn the online advertisement of the tutoring center \"Capture Star\", it is stated that students can enroll in Form 4 and Form 5 at Tsung Tsin Middle School, along with DSE-related courses and teaching materials provided by Capture Star.\n\nThe advertisement includes screenshots of documents from the Education Bureau and the Hong Kong Examination and Assessment Authority, asserting that the school is a legitimate DSE exam participating institution.\n\nTuition fees, including donations, are listed between HK$160,000 and HK$190,000 per year, with an additional monthly fee of HK$10,000 for students seeking accommodation.\n\nInterested students reportedly need to take an admission test scheduled for August 17 in Shenzhen, with an examination fee of HK$700.\n\nIn response to media inquiries, the Education Bureau emphasized that it has not received any applications from Capture Star to operate courses or partner with Tsung Tsin Middle School for school operations.\n\nIt stressed that enforcement actions have been taken, advising parents and students to remain vigilant and avoid being misled.\n\nReports indicated that the involved mainland tutoring center was established in 2014, offering year-round DSE programmes and summer training programs, with campuses in Nanshan and Futian in Shenzhen.\n\nAccording to the center's social media posts, it claimed that a total of 284 students participated in this year's DSE exam, with over 90 percent gaining admission to universities such as the University of Hong Kong, Chinese University of Hong Kong, and Hong Kong University of Science and Technology, enrolling in fields like medicine, dentistry, and computational finance.\n\nEducation Committee sector lawmaker Lawrence Tang Fei expressed that the center conducting enrollment, tutoring, and teaching activities at Tsung Tsin Middle School could potentially violate regulations.\n\nMeanwhile, education lawmaker Chu Kwok-keung highlighted the lack of regulation surrounding mainland tutoring institutions offering DSE courses in recent years, urging the government to take action to prevent potential negative reputations on the \"Study in Hong Kong\" brand.\n\nHe also called for the government to cooperate with mainland authorities to regulate improper marketing practices.\n\nIt was learned that the online advertisement from Capture Star has been deleted after the incident.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/264bea78bb872064a7ec13e7828c40cc/2025-08/20250204134445indexPhoto.jpg",
    "sponsored": false,
    "id": "4b772518e72d27d3"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308516/KTSP-to-open-one-of-HKs-largest-themed-childrens-playgrounds-on-Fri",
    "headline": "KTSP to open one of HK’s largest themed children's playgrounds on Fri",
    "date": "2025-08-07T21:15:46.000+0800",
    "body": "Kai Tak Sports Park (KTSP) will open a 4,000-square-meter children's playground in the North Garden to the public starting Friday.\n\nAs one of the city's largest playgrounds, the facility is inspired by salt fields that date back to the Song Dynasty and is divided into five sections.\n\nThe park features hills in varying color tones, including yellow, green, blue, red, and orange, which represent the five elements of Chinese philosophy—metal, wood, water, fire, and earth—respectively.\n\nThe playground includes interactive installations such as a sandpit, climbing walls, zip lines, and two 10-meter-tall play towers, while barrier-free design elements have also been incorporated to stimulate children’s sensory development.\n\nSeparately, KTSP’s multi-purpose courts, which can be configured for tennis, basketball, and volleyball, will open to the public in the third quarter.\n\nThese facilities are designed to support collaborative training and community activities and serve as warm-up zones for major competititons.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/e124939e694e242c4058fabcf959f513/2025-08/1_3.jpg",
    "sponsored": false,
    "id": "de2a9d0acc5d11c0"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308510/Residents-on-alert-after-HK-reports-3-imported-chikungunya-cases",
    "headline": "Residents on alert after HK reports 3 imported chikungunya cases",
    "date": "2025-08-07T20:04:04.000+0800",
    "body": "Prashan Limbu\n\nHong Kong confirmed three imported cases of chikungunya fever on Wednesday, prompting heightened mosquito prevention measures in affected neighborhoods.\n\nThe patients include a father-son pair from Tsing Yi's Mount Haven who recently traveled to Bangladesh and a 79-year-old woman from Lei Tung Estate in Ap Lei Chau who visited Foshan last month.\n\nIn Lei Tung Estate, which houses three kindergartens and is surrounded by greenery, some residents have expressed concern despite existing mosquito control measures like insecticide lamps. According to one resident, there has been an increase in the frequency of drain cleaning and mosquito spraying. Parents are taking extra precautions, with many avoiding prolonged outdoor activities at dusk.\n\nA resident surnamed Ho mentioned that they have started applying mosquito repellent more frequently and advised their son to wear long pants while outside. They also plan to postpone trips to mainland China until the number of cases declines.\n\nAn elderly resident named Ah Yiu acknowledged the government's increased disinfection efforts but pointed out practical difficulties, noting that the humidity following heavy rains makes wearing long sleeves unbearable. They prefer to use repellent and reduce their time outdoors.\n\nA grandmother surnamed Tsui, who was seen spraying repellent on her granddaughter before school, expressed a resigned concern about the situation. She hopes for intensified mosquito control efforts near drains and plants, recognizing that despite precautions, infections can still occur due to Hong Kong's heat.\n\nThe Food and Environmental Hygiene Department has intensified cleaning and insecticide spraying in the areas.\n\nChikungunya, transmitted by Aedes mosquitoes, causes fever and severe joint pain.\n\nHealth authorities recommend using repellent and eliminating stagnant water to help prevent the spread of the virus.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/ab922b7d711da4834122311b61d33a47/2025-08/10321056786.jpg",
    "sponsored": false,
    "id": "dcaf711088976ee0"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308509/HK-brands-thrive-in-mainland-e-commerce-as-78pc-consumers-favor-Hong-Kong-products",
    "headline": "HK brands thrive in mainland e-commerce as 78pc consumers favor Hong Kong products",
    "date": "2025-08-07T19:30:54.000+0800",
    "body": "Judy Cui\n\nConsumers from the mainland exhibit a strong confidence in brands from Hong Kong, with 78 percent having purchased Hong Kong products online within the past year -- particularly prevalent among high-spending individuals from Tier-1 or Greater Bay Area cities -- according to a survey by the Hong Kong Trade Development Council (HKTDC).\n\nHKTDC commissioned an agency to interview 2,200 middle-class consumers in the mainland during the second and third quarters of 2024, and the report on Hong Kong Businesses Navigating Mainland China E-commerce Retail Market - Consumer Survey Results was released on Thursday.\n\nAmong the respondents who have bought Hong Kong products online in the past year, 85 percent are from the Tier-1 cities, 81 percent in the Greater Bay Area, 78 percent in Tier-2 cities and 74 percent living in the Tier-3 cities.\n\nIn terms of age distribution, 83 percent of respondents in the 18-29 age group said they had bought Hong Kong products online in the past year, followed by consumers aged 30-49 that accounting for 82 percent, while the proportion among consumers above 50 years old stood at 65 percent.\n\nIn Tier-1 and Tier-2 cities, as well as those in GBA, significantly more female consumers have bought Hong Kong products online.\n\nConsumers identified authenticity as the most critical factor when making purchases, followed by brand reputation and product diversity, with price being the least significant consideration.\n\nMeanwhile, the average rating for Hong Kong products has reached 8.7, particularly for electronics, luxury items, and fashion products.\n\n\"This suggests that Hong Kong businesses can leverage the superior quality of Hong Kong products and the strong reputation of Hong Kong brands in Mainland China to expand into the Mainland e-commerce market,\" HKTDC Director of Research Irina Fan Yuen-yee said.\n\nShe added that local businesses can leverage the advantage of Hong Kong brands, and flexibly use comprehensive shelf and \"interest-based\" e-commerce platforms to sell online along with gimmicks like live-streaming and short videos for promotion.\n\nThe Principal Economist (Greater China) of HKTDC Wing Chu noted that consumers generally demand quick delivery, and their expectations in this regard continue to rise.\n\n\"It's worth noting that Mainland consumers who purchase Hong Kong products online tend to spend a higher average order amount on children's products, drugs and health supplements, and pet products compared to the overall average,\" he added.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/5839c3ca0ea130b98fc225e04a8ef156/2025-08/1_0.JPG",
    "sponsored": false,
    "id": "4f78e4b7b057174e"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308504/Teen-girls-fall-in-separate-incidents-One-dead-one-injured",
    "headline": "Teen girls fall in separate incidents: One dead, one injured",
    "date": "2025-08-07T19:08:25.000+0800",
    "body": "Liuliu Yang\n\nTwo teenage girls fell from height in separate incidents in Hong Kong within 24 hours, leaving one dead and another hospitalized, police said.\n\nA 19-year-old woman, surnamed Tang, was reported missing by her family around 7pm on Wednesday (Aug 6) after she left her home in Yat Tung Estate, Tung Chung.\n\nShe was later found unconscious on a rooftop platform of Ying Yat House and was pronounced dead at the scene.\n\nNo suicide note was found, and initial investigations revealed that she had posted suicidal thoughts on social media earlier that day. It is believed that she had been struggling with emotional distress in the period leading up to the incident.\n\nPolice do not suspect foul play, but the case remains under investigation.\n\nAs for the second incident, a 15-year-old girl fell from Mei Wo House in Wo Che Estate, Sha Tin, at around 2am on Thursday morning (Aug 7).\n\nSecurity guards found her lying on a second-floor platform and immediately called emergency services. She remained conscious and was rushed to Prince of Wales Hospital for treatment.\n\nA handwritten farewell note was found at the scene. It is understood that she has a history of emotional distress. The case is also under investigation.\n\nIf you or someone you know has suicidal thoughts, help is available. Dial 2896 0000 for The Samaritans or 2382 2007 for Suicide Prevention Services.You can also call Suicide Prevention Services at 2382 0000 or CEASE Crisis Centre of Tung Wah Groups of Hospitals at 18281.The government hotline 18111 can provide support for people with mental health needs and render immediate mental health support and referral services.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/639ae4fbac078fa3297f2c8fa7bbb6bb/2025-08/WhatsApp_Image_2025-08-07_at_7_03_37_PM.jpeg",
    "sponsored": false,
    "id": "ba56381509f15815"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308514/Violin-tutor-loses-court-battle-over-Housing-Authoritys-reclamation-of-public-flat-amid-utility-usage-concerns",
    "headline": "Violin tutor loses court battle over Housing Authority's reclamation of public flat amid utility usage concerns",
    "date": "2025-08-07T19:27:06.000+0800",
    "body": "Anson Luk\n\nA female violin tutor lost her judicial review against the Housing Authority's decision to reclaim her public flat after nearly 20 failed home visits and near-zero utility usage were discovered.\n\nLawmaker Scott Leung Man-kwong emphasized that public housing is a scarce resource for low-income citizens, and tenants must genuinely reside in their units.\n\nHe noted that the Housing Department's assessment of improper use relies on multiple methods—home visits, utility checks, security consultations, CCTV reviews, and neighbor inquiries—evaluated holistically.\n\nHe recalled past cases where victims had extremely low water and electricity usage, with the toilet not flushed and always dry.\n\nThey could prove they went home to sleep each night and used the nearby park for toilets and showers, which the Housing Authority accepted.\n\nThe court on August 6 rejected violin tutor Tang Wai-yin's judicial review request, ruling the grounds lacked reasonable arguability.\n\nThe judge stated that the Housing Authority had no obligation to conduct visits at other times, and that utility usage was just one among various factors considered by the Housing Authority.\n\nThe judge ruled that the applicant failed to provide arguable grounds for judicial review, dismissed the application, and ordered the applicant to pay the Housing Authority's legal costs.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/4d45de441079a2892c30f11b34e4cfd6/2025-08/PH.jpg",
    "sponsored": false,
    "id": "9af703e0bc0566d6"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308501/Brides-Pool-Road-reopens-northbound-lane-at-10pm",
    "headline": "Bride's Pool Road reopens northbound lane at 10pm",
    "date": "2025-08-07T18:46:57.000+0800",
    "body": "Anson Luk\n\nThe Highways Department announced that the previously closed section of Bride’s Pool Road south of the barbecue area, damaged by a rain-triggered landslide, will reopen by 10pm tonight.\n\nThe northbound traffic lane will be reopened to single lane with two-way traffic, allowing light vehicles such as private cars and minibuses to pass, while the pedestrian walkway will also reopen.\n\nThe department stated on its social media page that, together with the contractor, it has allocated additional resources in recent days to expedite repair work, with the cooperation of relevant departments.\n\nAdditionally, today's weather was more stable than expected, further accelerating the progress of the project.\n\nThe contractor deployed multiple large-scale machines to urgently reinforce the slope using rock fill and increased manpower for clearing mud and debris that had collapsed onto the slope and roadside.\n\nThe department also dispatched a team of small drones to conduct surveying work, capturing high-definition images and videos from aerial angles to accurately assess the location of the landslide, the looseness of nearby soil, and the source of the landslide.\n\nThis helped precisely calculate the required amount of rock fill, and the Civil Engineering and Development Department's fill material depot supplied sufficient rock fill to ensure the smooth progress of the project.\n\nThe department also thanked nearby residents for their understanding regarding the inconvenience caused by the temporary closure of the affected road section.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/391f63481fad816c881296a1211c063b/2025-08/528386081_122141373584410993_6973368976661527176_n.jpg",
    "sponsored": false,
    "id": "7ac5f2add9330870"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308502/Customs-seizes-44m-in-counterfeit-goods-in-major-cross-border-operation",
    "headline": "Customs seizes $44m in counterfeit goods in major cross-border operation",
    "date": "2025-08-07T18:49:58.000+0800",
    "body": "Prashan Limbu\n\nIn a significant crackdown on counterfeit goods trafficking, Hong Kong Customs has confiscated nearly 67,000 fake luxury items valued at approximately HK$44 million.\n\nThis action was part of a coordinated two-week operation, from July 18 to 31, involving authorities from mainland China and Macau.\n\nThe operation aimed to disrupt sophisticated smuggling networks that transport counterfeit goods through Hong Kong, Macau, and mainland China, with many of the shipments destined for the U.S., Europe, and countries involved in the Belt and Road Initiative.\n\nDuring the crackdown, customs officers made several key breakthroughs. They uncovered 19 separate cases of counterfeit goods at various express delivery and logistics companies based in Hong Kong.\n\nA significant find occurred at the Tuen Mun River Trade Terminal, where inspectors discovered a 40-foot shipping container filled with counterfeit items ready for transshipment.\n\nThe operation also extended to major border crossings, including the Hong Kong-Zhuhai-Macao Bridge and the Shenzhen Bay Control Point.\n\nHere, officers detected five additional cases involving counterfeit merchandise being transported by incoming trucks.\n\nThis led to the arrest of five male drivers, aged between 53 and 69, who have since been released on bail pending further investigations.\n\nA spokesperson for Customs highlighted the importance of such coordinated efforts, stating that the operation underscores their commitment to protecting intellectual property rights and maintaining fair trade practices through close collaboration with regional partners.\n\nThe seized items included convincing replicas of high-end watches, designer handbags, sports apparel, and footwear, all bearing forged trademarks.\n\nUnder Hong Kong's Trade Descriptions Ordinance, those convicted of importing or exporting counterfeit goods could face severe penalties, including fines up to HK$500,000 and five years of imprisonment.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/4f6cc60a41cf02658e0345b169ac62c2/2025-08/01_1_2.jpg",
    "sponsored": false,
    "id": "5fa91d0843669565"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308500/Pandas-Ying-Ying-and-Le-Le-celebrate-20th-birthdays-with-ice-cakes",
    "headline": "Pandas Ying Ying and Le Le celebrate 20th birthdays with ice cakes",
    "date": "2025-08-07T18:42:11.000+0800",
    "body": "Anson Luk\n\nOcean Park Hong Kong's pandas ‘Ying Ying’ and ‘Le Le’ celebrated their 20th birthdays this month, with the park preparing ice cakes for their celebration.\n\nThe team selected purple sweet potatoes, carrots, apples, and fresh bamboo leaves—all beloved by giant pandas—as the main ingredients to create the numerals ‘two’ and ‘zero’, as well as a giant bamboo shoot symbolizing vitality, righteousness, and prosperity.\n\nFor Le Le's ice cake, small decorations such as building blocks, a rocket, and a car were added.\n\nMeanwhile, Ying Ying's ice cake was adorned with heart and flower decorations, with the letters ‘Y’, ‘I’, ‘N’, and ‘G’ spelling out her English name—Ying.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/49c355234b54b0dce3ff0591b6d4fa5e/2025-08/NY250527OP54.jpg",
    "sponsored": false,
    "id": "dc73c61238ebbb24"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308497/Tokyos-acclaimed-Ramenya-Shima-to-open-Hong-Kong-store",
    "headline": "Tokyo's acclaimed Ramenya Shima to open Hong Kong store",
    "date": "2025-08-07T18:25:55.000+0800",
    "body": "Hong Kong ramen enthusiasts have reason to celebrate as Tokyo's celebrated Ramenya Shima—currently ranked among Japan's top three ramen shops on Tabelog—announced plans to expand to the city.\n\nThe New Shinjuku-based establishment, which holds an impressive 3.99/5 rating on Japan's premier restaurant review platform, made the revelation via an August 6 social media post noting temporary closure from August 12 to 15 for \"Hong Kong expansion preparations.\"\n\nWhile details remain unclear about whether this will be a pop-up or permanent location, the news has generated significant buzz among foodies.\n\nSince its 2020 debut, Ramenya Shima has earned critical acclaim including TRY Ramen Awards' \"Best Newcomer\" distinction. It currently ranks #2 in Tokyo and #4 nationally on Tabelog's competitive ramen rankings.\n\nThe shop's signature shoyu (soy sauce) ramen features a meticulously crafted broth blending free-range Japanese chicken, pork bone, seafood, and artisanal soy sauces.\n\nEach bowl comes adorned with char siu pork, truffle-infused chicken breast, wontons, and premium accompaniments.\n\nNotably, the Japanese store operates on an exclusive reservation system, releasing around 60 bowls daily via online bookings that open at 8am one day prior. Hong Kong operations specifics await official announcement.\n\nWith its exact location and opening date still undisclosed, the expansion promises to bring authentic Tokyo ramen craftsmanship to Hong Kong's vibrant dining scene.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/23f721d94b553213e6428d12e8f4e7f6/2025-08/RAMEN.jpg",
    "sponsored": false,
    "id": "32ef6c107c5a7059"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308496/Japanese-drugstore-giant-Daikoku-Drug-makes-HK-debut-with-bargain-prices",
    "headline": "Japanese drugstore giant Daikoku Drug makes HK debut with bargain prices",
    "date": "2025-08-07T18:14:01.000+0800",
    "body": "Anson Luk\n\nHong Kong shoppers are about to get a major new option for Japanese products as Daikoku Drug, Japan's beloved discount pharmacy chain, opens its first overseas store in Tsim Sha Tsui on Thursday.\n\nThe landmark opening marks a strategic expansion for the Osaka-based retailer, which operates about 160 locations across Japan.\n\nArnold Lau Chi-yuen, associate director-general of Invest Hong Kong, hailed the arrival as a boost to the city's retail landscape.\n\nHe said Daikoku Drug's presence offers more choices for consumers and enriches the city’s retail sector, pledging continued support for the company's regional growth plans.\n\nFor Daikoku Drug chairman Shintaro Kanbe, the Hong Kong launch represents a pivotal moment.\n\nKanbe said the brand is excited to bring its unique shopping experience to Hong Kong and use the city as a springboard into Greater China and Southeast Asia.\n\nPositioning itself as a formidable competitor to established Japanese retailers like Matsumoto Kiyoshi and DON DON DONKI, Daikoku Drug Hong Kong will stock nearly 5,000 products spanning pharmaceuticals, cosmetics, household goods, and popular Japanese snacks.\n\nThe store promises aggressively competitive pricing, including Japan's popular lemon drinks for just HK$10.8 per bottle—reportedly Hong Kong's lowest price—and NY Perfect Cheese cream crackers at HK$78 per box—undercutting local competitors.\n\nTo celebrate its launch, Daikoku Drug will offer 15 percent off all non-medical purchases from August 7 to 21. The promotion underscores the chain's reputation for value—a hallmark since its 1957 founding when it pioneered Japan's discount drugstore concept.\n\nWith 179 stores concentrated in Tokyo and Osaka, Daikoku Drug has long catered to international tourists through Chinese-speaking staff.\n\nThe Hong Kong flagship, located at 22-24 Cameron Road, will operate daily from 10am to 10pm, serving as both a retail hub and regional headquarters for the company's ambitious overseas expansion.\n\nDaikoku Drug (Hong Kong)Address: 22-24 Cameron Road, Tsim Sha Tsui  Opening hours: 10am to 10pm (Monday to Sunday)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/883052dc3d30c8fe1f83d1a58e9f1810/2025-08/WhatsApp_Image_2025-08-06_at_12_59_00_0.jpeg",
    "sponsored": false,
    "id": "89482e706d91875a"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308495/Eight-arrested-for-staging-traffic-accidents-to-cash-in-on-TAVA-scheme",
    "headline": "Eight arrested for staging traffic accidents to cash in on TAVA scheme",
    "date": "2025-08-07T17:52:31.000+0800",
    "body": "The police announced on Thursday the arrest of eight individuals who allegedly staged traffic accidents to fraudulently apply for aid under the Traffic Accident Victims Assistance (TAVA) scheme, involving approximately HK$730,000.\n\nFollowing the referral cases from the Social Welfare Department (SWD) in April, the police launched an operation over the past three days, arresting seven men and one woman aged between 22 and 60, suspected of committing fraud.\n\nThe arrestees, who claimed to be warehouse workers, transport laborers, or unemployed, have all been granted bail and are required to report to the police in early September.\n\nInvestigations revealed that the individuals had scripted and acted out the traffic incidents, with drivers claiming injuries from accidents occurring in the early morning while avoiding dogs and slippery road conditions.\n\nPolice stated that the suspects submitted multiple fabricated medical certificates, applying for financial aid with sick leave ranging from 94 to 180 days for their alleged injuries under the scheme.\n\nNotably, one individual reportedly defrauded the scheme of around HK$100,000 by applying for a 180-day sick leave subsidy.\n\nAccording to the police, a total of 353 individuals were arrested for fraud related to assistance programs as of June 25, adding the referral cases from SWD has significantly dropped from over 300 to around 10 cases since last March.\n\nThe SWD announced new arrangements for the TAVA scheme at the end of June, merging the \"Injury Grant\" and \"Interim Maintenance Grant\" into a single \"Compassionate Grant\" (CG).\n\nThe maximum sick leave for applications has been capped at 60 days, where applicants must provide certification from a registered medical practitioner confirming that at least seven days of hospitalization is required or that they have a minimum of seven days' sick leave.\n\nAdditionally, each applicant can only claim the CG once within a two-year period and the assistance amount of CG will be adjusted according to the established mechanism annually.\n\nThe SWD emphasized its commitment to closely monitor the implementation of these new arrangements, noting that any suspected cases of fraud or other criminal activities will be referred to the police for further investigation.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/a3099a8f968bde2d53908727a9df00f6/2025-08/page_82.jpg",
    "sponsored": false,
    "id": "fdfa4d3353831af2"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308484/Cyclists-fined-1000-over-road-rage-incident",
    "headline": "Cyclists fined $1,000 over road rage incident",
    "date": "2025-08-07T17:10:06.000+0800",
    "body": "Anson Luk\n\nTwo cyclists were fined HK$1,000 each today after admitting to riding illegally on pedestrian paths during a heated confrontation with a minibus driver last December in Tai Po.\n\nThe incident, captured on video, sparked a wider crackdown on reckless cycling behavior under Hong Kong's strict traffic laws.\n\nThe drama unfolded on December 14 last year when five cyclists—including defendants Cheung Chi-kin and Carina Li Wai-kwan—were riding on the road instead of using an adjacent designated cycle track along Tai Po Road.\n\nThe court heard that Cheung had gestured for the vehicle to pass after the minibus driver honked at the group, yet one cyclist continued to block its path. When the light turned red, the group—including Cheung and Li—mounted the sidewalk to bypass traffic.\n\nAccording to a video circulated online, the group had blocked the minibus and engaged in a verbal altercation with the driver before they left the scene. The clash escalated when one cyclist allegedly opened the minibus door to shout at the driver, prompting the driver to threaten to call the police.\n\nFollowing the incident, police arrested three men and a woman aged 28 to 45, with the remaining cyclist wanted by police. The four were slapped with nine charges, including failing to ride on the road set aside for bicycles, riding on the footpath without obvious necessity, and behaving in a disorderly manner in a public place.\n\nTwo of them, Cheung and Li, each pleaded guilty at Fanling Magistrates' Court today to failing to ride on the road set aside for bicycles and riding on the footpath without obvious necessity. They were each fined HK$1,000.\n\nThe plea for the remaining charges will be heard in a later court date on September 16, pending the other two defendants, Tsang Lik-him and Raymond Chu Wing-hin, to discuss with the prosecution alternative resolutions.\n\nThey were all granted bail on original conditions.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/0f0151ad78c91cb9941ed9857a316e09/2025-08/collage_2.jpg",
    "sponsored": false,
    "id": "4d5d64a37e49f7b2"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308476/AI-weather-models-predict-potential-storms-may-affect-HK-next-week-says-Observatory",
    "headline": "AI weather models predict potential storms may affect HK next week, says Observatory",
    "date": "2025-08-07T16:39:15.000+0800",
    "body": "Judy Cui\n\nThe Observatory has warned of showers and squally thunderstorms next week as an area of low pressure over the western North Pacific is expected to move westward in the coming days.\n\nThe ECMWF-AIFS weather forecast model suggests the potential storm could approach Hong Kong, while the \"Pangu\" model predicts it will skirt south of the city before making landfall near Zhanjiang.\n\nHowever, the \"Fengwu\" model indicates a more eastward shift, with the storm potentially heading toward Shantou -- which would result in lighter impacts for Hong Kong.\n\nThe Observatory said the low-pressure system's future path and intensity remain uncertain.\n\nMeanwhile, another low-pressure system near Luzon is expected to enter the South China Sea within the next few days, bringing scattered showers early next week.\n\nWith the anticyclone aloft shifting northwards, rainfall will increase gradually over the coast of southern China in the middle and latter parts of next week.\n\nAdditionally, the weather watchdog urged residents to stay updated on the latest forecasts in the next couple of days.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/6c9a398ac7a0f33344d97bbcc567ed09/2025-08/WhatsApp_Image_2025-08-07_at_16_36_41_595b8798.jpg",
    "sponsored": false,
    "id": "24ddc7b5d03b3e2c"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308474/HK-youth-sentenced-to-reform-center-for-molesting-9-year-old-half-sister",
    "headline": "HK youth sentenced to reform center for molesting 9-year-old half-sister",
    "date": "2025-08-07T16:33:28.000+0800",
    "body": "Prashan Limbu\n\nAn 18-year-old unemployed man has been ordered to undergo rehabilitation training after pleading guilty to molesting his 9-year-old half-sister in their Sham Shui Po flat in late 2023.\n\nThe court heard that the incident occurred when the girl, referred to as ,X asked her brother, referred to as P.M.S., to stay with her, as she was afraid of the dark.\n\nAfter X fell asleep, P.M.S. inappropriately touched her before being interrupted by their mother returning home unexpectedly .\n\nThe mother found the door obstructed, and after forcing it open, she saw her son, coming out from behind the door.\n\nSensing something was wrong, she noticed her daughter lying stiffly under a blanket.\n\nWhen she lifted it, she discovered the girl was naked from the waist down. X later confided that her brother had touched her private parts.\n\nThe following day, the parents took their son to the police station, where he surrendered.\n\nThe siblings come from a troubled family background. Psychological reports indicated that the young victim suffered severe emotional trauma, developed depression, and required long-term counseling.\n\nThe defendant claimed that his actions were driven by loneliness and a need for connection.\n\nJudge Douglas Yau Tak-hong referred to the case as a \"family tragedy,\" noting that the defendant had breached the trust that should exist between siblings.\n\nAlthough the offense could have led to a maximum sentence of 10 years, the judge took into account several mitigating factors, such as the defendant's youth and the incident being a one-time occurrence.\n\nInstead of prison, the court decided on rehabilitation training, which it believed would better facilitate the P.M.S.'s reform and reintegration.\n\nThe judge stressed that this approach was a balance between holding the defendant accountable and allowing for the possibility of rehabilitation.\n\nBefore the sentencing, Yau urged the defendant to take responsibility and seek professional help, and he encouraged the fractured family to support each other in their recovery.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/73cdbdd346b1b0395face2198a4cb56c/2025-08/KakaoTalk_20250411_122046817_01_0.jpg",
    "sponsored": false,
    "id": "15eb30051d4001d0"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/breaking-news/article/308492/Daily-News-Recap-August-7-2025",
    "headline": "Daily News Recap - August 7, 2025",
    "date": "2025-08-07T20:28:41.000+0800",
    "body": "Health expert expects steady rise in imported chikungunya cases\n\nHong Kong has recorded three new imported cases of chikungunya fever, bringing this year's total to four, with medical experts warning that infections are likely to increase steadily due to frequent cross-border travel and favorable conditions for disease-carrying mosquitoes.\n\nHK steps up mosquito control at housing estates after chikungunya cases\n\nAuthorities have intensified mosquito eradication efforts at two housing estates following the confirmation of imported chikungunya fever cases among residents, with cleaning crews working to eliminate potential breeding grounds and care teams distributing anti-mosquito products to concerned households.\n\nResidents on alert after HK reports 3 imported chikungunya cases\n\nHong Kong confirmed three imported cases of chikungunya fever on Wednesday, prompting heightened mosquito prevention measures in affected neighborhoods.\n\nAI weather models predict potential storms may affect HK next week, says Observatory\n\nAI weather models predict potential storms may affect HK next week, says Observatory\n\nGovt recovers 9,000 misued public housing units, saving billions in construction: Winnie Ho\n\nIn an effort to combat abuse of public housing resources, the government has recovered approximately 9,000 public rental housing (PRH) flats from July 2022 to June 2025, according to Secretary for Housing Winnie Ho Wing-yin.\n\nEight arrested for staging traffic accidents to cash in on TAVA scheme\n\nThe police announced on Thursday the arrest of eight individuals who allegedly staged traffic accidents to fraudulently apply for aid under the Traffic Accident Victims Assistance (TAVA) scheme, involving approximately HK$730,000.\n\nHKTDC survey: Hong Kong products lead Mainland e-commerce trends\n\nMainland consumers prefer Hong Kong products for their quality, authenticity, and brand trust, offering a strong base for HK firms in the e-commerce market, a survey by Hong Kong Trade Development Council showed.\n\nHK brands thrive in mainland e-commerce as 78pc consumers favor Hong Kong products\n\nConsumers from the mainland exhibit a strong confidence in brands from Hong Kong, with 78 percent having purchased Hong Kong products online within the past year -- particularly prevalent among high-spending individuals from Tier-1 or Greater Bay Area cities -- according to a survey by the Hong Kong Trade Development Council (HKTDC).\n\nNew World shares surge on report of take-private deal talks\n\nShares of cash-strapped Hong Kong property developer New World Development (0017) surged on Thursday after a media report on a potential take-private deal.\n\nTrump says \"billions of dollars\" will flow into the US, as higher tariff rates are imposed\n\nPresident Donald Trump's higher tariff rates of 10 percent to 50 percent on dozens of trading partners kicked in on Thursday, testing his strategy for shrinking US trade deficits without massive disruptions to global supply chains, higher inflation and stiff retaliation from trading partners.\n\nWharf REIC H1 loss more than doubles to HK$2.41 bln on office market drag\n\nWharf Real Estate Investment Company (1997) reported a net loss attributable to equity shareholders of HK$2.41 billion for the first half of 2025, widening 129 percent from HK$1.05 billion a year earlier, as office rents remained under pressure.\n\n5 dead, 24 injured in suspension bridge accident in Xinjiang\n\nA suspension bridge accident at a scenic spot in northwest China's Xinjiang Uygur Autonomous Region left five people dead and 24 others injured, local authorities said Wednesday (Aug 6).\n\nDangerous dreams: Inside internet's 'sleepmaxxing' craze\n\nFrom mouth taping to rope-assisted neck swinging, a viral social media trend is promoting extreme bedtime routines that claim to deliver perfect sleep -- despite scant medical evidence and potential safety risks.\n\nThird-hottest July on record wreaks climate havoc\n\nThe third-hottest July worldwide ended a string of record-breaking temperatures last month, but many regions were still devastated by extreme weather amplified by global warming, the European climate monitoring service said Thursday.\n\nTrump says likely to meet Putin 'very soon'\n\nDonald Trump said Wednesday he could meet with Vladimir Putin \"very soon,\" following what the US president described as highly productive talks\n\nEmbracing diversity through Mughal art: a chance for Hong Kong to shine\n\nThe unveiling of the Hong Kong Jockey Club Series: Treasures of the Mughal Court at the Hong Kong Palace Museum marks a significant cultural milestone for the city.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/190ae4a59aff428c1ce8daa13547577a/2025-08/WhatsApp_Image_2025-08-07_at_8_24_51_PM.jpeg",
    "sponsored": false,
    "id": "fc5f418971f8090e"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308411/HK-logs-three-new-chikungunya-fever-cases",
    "headline": "HK logs three new chikungunya fever cases",
    "date": "2025-08-06T20:05:37.000+0800",
    "body": "Anson Luk\n\nThe Centre for Health Protection (CHP) of the Department of Health is investigating three newly logged imported chikungunya fever (CF) cases, in which the patients are living in Tsing Yi and Ap Lei Chau.\n\nThe first case involved a 79-year-old woman from Lei Tung Estate. She visited Foshan, Guangdong, from July 1 to July 31. She developed fever and joint pain on Monday (Aug 4) and was admitted to Queen Mary Hospital the next day.\n\nShe tested positive for the chikungunya virus, and her health condition is stable.\n\nSince most of her incubation period was in Foshan, it is considered an imported case. No travel companions or household contacts were affected.\n\nThe second and third cases involved a 55-year-old man with chronic illness and his 10-year-old son from Mount Haven in Tsing Yi. They traveled to Bangladesh from July 12 to August 3.\n\nThe man developed symptoms on July 27 and sought treatment on August 4 at Princess Margaret Hospital.\n\nThe boy fell ill on August 1 and was treated at Hong Kong Adventist Hospital - Tsuen Wan before being transferred to Princess Margaret Hospital on August 5.\n\nBoth tested positive for the chikungunya virus and are currently stable.\n\nCHP believes the patients were infected during their trip to Bangladesh, classified as imported cases.\n\nTwo household contacts who traveled with them are asymptomatic and under medical surveillance.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/33c5488b797c8752ef0c5d22d331fd20/2025-08/05261835.jpg",
    "sponsored": false,
    "id": "6145a8fa6defa01e"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/breaking-news/article/308404/MTR-Tuen-Ma-Line-service-gradually-resuming-after-disrupted-by-faulty-train",
    "headline": "MTR Tuen Ma Line service gradually resuming after disrupted by faulty train",
    "date": "2025-08-06T18:08:11.000+0800",
    "body": "MTR Corporation announced that the faulty train near Tai Shui Hang Station has now moved away, and train service on the Tuen Ma Line is gradually resuming.\n\nThis came after the railway giant earlier stated that the total journey time between Tai Wai Station and Wu Kai Sha Station could be extended by 10 to 15 minutes due to the issue.\n\n(Updated at 6.27pm)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/93e9e44658d1e1e793502d15bdfa8681/2025-08/50092794indexPhoto.jpg",
    "sponsored": false,
    "id": "f71e6cb8dd237ee1"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308378/Showers-and-squally-thunderstorms-next-Thurs-as-low-pressure-area-approaches-says-Observatory",
    "headline": "Showers and squally thunderstorms next Thurs as low-pressure area approaches, says Observatory",
    "date": "2025-08-06T15:26:14.000+0800",
    "body": "Judy Cui\n\nHong Kong's weather will remain unstable following the heavy rainfall, as the Observatory warned that an area of low pressure will move closer to Luzon on Thursday (August 7).\n\nThe weather forecaster said that the low-pressure area, now located over waters east of the Philippines, may enter the South China Sea next week and bring showers and squally thunderstorms to Hong Kong.\n\nThe AI weather forecast model \"Fengwu\" anticipated that a potential tropical cyclone would pass south of Hong Kong between next Wednesday (Aug 13) and Thursday (Aug 14) before eventually moving toward Hainan Island.\n\nThe Observatory noted that \"Fengwu\" successfully predicted last Tuesday's black rainstorm one week in advance.\n\nAdditionally, showers will ease along the Guangdong coast tomorrow (Aug 7) as the southwest monsoon moderates and upper-air disturbances weaken.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/4cf095a5258055ebba8ba6eeec9cd44a/2025-08/FENGWU.jpg",
    "sponsored": false,
    "id": "07a0a5a8e8dcf8fd"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308281/Black-Rainstorm-Warning-downgraded-to-Amber-as-thundery-showers-subside",
    "headline": "Black Rainstorm Warning downgraded to Amber as thundery showers subside",
    "date": "2025-08-05T16:21:09.000+0800",
    "body": "The Observatory issued the Amber Rainstorm Warning Signal to replace the Black one at 5.05pm, as the areas of thundery showers now affecting the territory are departing gradually.\n\nThe Amber signal is expected to remain in force in the next couple of hours. The forecaster said there will still be showers locally, and heavy at times at first.\n\nAn active southwest monsoon and upper-air disturbances will still continue to bring heavy showers and squally thunderstorms to the coast of Guangdong on Wednesday (Aug 6). With the southwest monsoon moderating and upper-air disturbances weakening, showers will ease off gradually over the coastal areas in the latter part of the week.\n\n(Updated at 5.13pm)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/5dde25a8a77400f7368ce6d49d286160/2025-08/KakaoTalk_20250805_100632007_07.jpg",
    "sponsored": false,
    "id": "d9638b4a7696955f"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308262/Banks-museum-close-under-inclement-weather",
    "headline": "Banks, museum close under inclement weather",
    "date": "2025-08-05T13:43:54.000+0800",
    "body": "Anson Luk\n\nBanks in the city have closed on Tuesday (Aug 5), while the M+ Museum announced its closure for the whole day due to inclement weather.\n\nIn accordance with the Hong Kong Association of Banks' arrangements during severe weather, the banks will remain closed for the day as the Black Rainstorm Warning Signal remains in effect at 12pm.\n\nMeanwhile, the M+ Museum in the West Kowloon Cultural District announced that it will remain closed today as the Black rainstorm warning is expected to stay in force at least until 3.00 pm.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/8a1653853d39e48b7200b18097ba939c/2025-08/20241205191531indexPhoto.jpg",
    "sponsored": false,
    "id": "18534299a420c20c"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308234/Adverse-weather-and-flooding-disrupt-public-transportation-services-across-the-city",
    "headline": "Adverse weather and flooding disrupt public transportation services across the city",
    "date": "2025-08-05T10:31:25.000+0800",
    "body": "The Transport Department announced that due to adverse weather and flooding, a number of road sections are closed to all traffic, including all lanes of Lung Cheung Road (Kwun Tong bound) near Ngau Chi Wan Village.\n\nDue to flooding, the following road sections are closed to all traffic:\n\nDue to landslide, the following road section is closed to all traffic:\n\nAccording to MTR Corporation, the B3 exit at Wong Tai Sin station, the A2 exit at Sham Shui Po station, the A1 exit at Choi Hung station and the A3 exit at Wan Chai station are temporarily closed as preventative flooding measures are in place. The A exit at Quarry Bay station, H exit at Kowloon Tong station and A exit at Wong Tai Sin station are closed due to flooding near stations.\n\nDue to flooding or landslides, KMB Route 91, 91M, 92, 94 and KMB Tour HK HK1 are temporarily suspended. As for the CityBus, routes 15C, H1, H1S, H2, H3, H4 are suspended until further notice.\n\nThe tram service between Causeway Bay Terminus and Shau Kei Wan Terminus, which was suspended due to a power supply issue, has resumed normal.\n\n(Updated at 10.51pm)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/4f4d30317a169a14216af407abebd626/2025-08/AAA.jpg",
    "sponsored": false,
    "id": "af4d0a02ef843129"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308232/Heavy-rain-disrupts-Queen-Mary-Hospital-AE-Department-services",
    "headline": "Heavy rain disrupts Queen Mary Hospital A&E Department services",
    "date": "2025-08-05T09:52:59.000+0800",
    "body": "Severe flooding has occurred on some roads within Queen Mary Hospital, affecting the service of the Accident and Emergency Department.\n\nThe Hospital Authority (HA) has notified the Fire Services Department to divert patients transported by ambulance to Ruttonjee Hospital temporarily.\n\nIt will closely monitor the situation to ensure that other emergency services are not affected.\n\nSeparately, the Immigration Department announced that services at the Immigration Headquarters and all Branch Offices, Registration of Persons Offices and Births, Deaths and Marriage Registries are temporarily suspended.\n\nThe Children Community Vaccination Centre (CCVC) and Private Clinic COVID-19 Vaccination Stations (PCVSs) under the COVID-19 Vaccination Programme will remain closed and their vaccination service will be suspended. The CCVC and PCVSs will reopen and resume vaccination service two hours after the cancellation of Black Rainstorm Warning Signal and will operate until the normal closing time.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/27f837ee2e960933561d8a8909b793c7/2025-08/QMH.jpg",
    "sponsored": false,
    "id": "2c07f5a880e0ffc3"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308229/Black-Rainstorm-Warning-to-remain-in-force-until-5pm-300mm-rainfall-recorded-over-HK-Island-and-Sai-Kung",
    "headline": "Black Rainstorm Warning to remain in force until 5pm, 300mm rainfall recorded over HK Island and Sai Kung",
    "date": "2025-08-05T09:19:59.000+0800",
    "body": "Kelvin Wan\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nThe Black Rainstorm Warning Signal will remain in force at least until 5pm, the Observatory said.\n\nMore than 100 millimeters of rainfall were generally recorded over the territory, and rainfall even exceeded 300 millimeters over Hong Kong Island, Kowloon and Sai Kung District.\n\nThe forecaster said areas of intense thundery showers associated with active southwest monsoon and upper-air disturbances continue to affect Hong Kong and the vicinity of the Pearl River Estuary.\n\nThe current rainstorm warning has been hoisted from 5.50am. The forecaster issued another Black rainstorm signal last night at 11.45pm, which was subsequently downgraded to an Amber signal at 3am.\n\nThe heavy downpour has caused serious road flooding and traffic congestion across the city, and authorities advised the public to seek safe shelter.\n\nHeavy rain may also bring flash floods, and flooding may also occur in watercourses.\n\nThe weather watchdog said the Emergency Monitoring and Support Centre of the government will continue to monitor the overall situation.\n\n(Updated at 2.10pm)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/92b8d0ee61e1416fe1423b90ae77f0cb/2025-08/BLACK.jpg",
    "sponsored": false,
    "id": "5c249d6d8c2701e4"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308140/Amber-rainstorm-warning-in-force-afternoon-schools-suspended",
    "headline": "Amber rainstorm warning in force, afternoon schools suspended",
    "date": "2025-08-04T12:37:20.000+0800",
    "body": "Kelvin Wan\n\nThe Observatory downgraded the Red Rainstorm Warning Signal to Amber at 1.25pm, while the Education Bureau announced that all PM schools are suspended.\n\nThe forecaster said more than 40 millimeters of rainfall were recorded across the city in the past couple of hours, and rainfall even exceeded 70 millimeters over parts of Kowloon.\n\nThe Red rainstorm warning signal was issued at 12.20pm, and the Education Bureau announced that schools should keep their premises open and implement contingency measures to look after arriving students.\n\nThe Bureau added that as the rainstorm warning signal is downgraded to Amber, classes of evening schools will proceed as usual tonight unless advised otherwise.\n\n(Updated at 1.37pm)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/6a4bf18af07287b1ba647f4852515365/2025-08/KakaoTalk_20250710_143304194_06_0.jpg",
    "sponsored": false,
    "id": "f549a491eb707446"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/308095/Amber-rainstorm-warning-issued",
    "headline": "Amber rainstorm warning issued",
    "date": "2025-08-03T11:25:32.000+0800",
    "body": "Kelvin Wan\n\nThe Observatory issued the Amber rainstorm warning signal at 11.20 am on Sunday.\n\nThe forecaster said widespread heavy rain is affecting Hong Kong, while intense gusts may also affect the city.\n\nMoreover, the Thunderstorm Warning has been issued at 6.58 pm on Saturday (Aug 2) and will remain in force until 12.30 pm today.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/de8e83e2bd49f7fb90ff64e490819d70/2025-08/KakaoTalk_20250802_130928575_05.jpg",
    "sponsored": false,
    "id": "a0a50d08bca5eb50"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/307974/Space-oil-to-be-named-Etomidate-starting-today-security-chief",
    "headline": "'Space oil' to be named 'Etomidate' starting today: security chief",
    "date": "2025-07-31T18:19:05.000+0800",
    "body": "Kelvin Wan\n\nThe dangerous drug \"Space Oil\" will now have the official name \"Etomidate\" starting from today, according to Secretary for Security Chris Tang Ping-keung.\n\nEtomidate is the main ingredient of the space oil drug, while it is also commonly used in clinical practice to induce anesthesia or to facilitate sedation.\n\nIt was up-regulated to a dangerous drug in February this year. Healthcare professionals should comply with relevant requirements on storage, issuance and maintain regular inspection when handling the drug.\n\nThe government initially intended to rename the drug to dispel its glamorous connotations, with names including \"zombie oil\" being suggested to reflect its debilitating effects.\n\nTang said that there were 327 recorded etomidate abusers in the first half of 2025, a 2.8-fold increase compared to the same period, exceeding the total for 2024. About 60 percent of these abusers were under the age of 21.\n\nEtomidate related cases accounted for 460 in the first half of the year, a 13-fold increase over the same period, with 561 arrests.\n\nSeizures of 300,000 etomidate cartridges were also reported this year, a 35-fold increase, according to the security chief.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/bbe75ca9fb98d13f105814610616b598/2025-07/20241105165650222348indexPhoto.jpg",
    "sponsored": false,
    "id": "79bf420fbee5b96f"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/307908/Thundery-showers-to-affect-HK-around-noon-HKO",
    "headline": "Thundery showers to affect HK around noon: HKO",
    "date": "2025-07-31T11:27:57.000+0800",
    "body": "The Observatory said areas of thundery showers continue to develop in the vicinity of the Pearl River Estuary and are expected to affect Hong Kong around noon.\n\nAccording to the special announcement, the thundery showers were developing under the influence of a broad trough of low pressure.\n\nThe broad trough of low pressure will continue to bring showers and thunderstorms to the coast of southern China on Friday (Aug 1), said the forecaster. Meanwhile, a hot southwesterly airstream will also affect the region.\n\nWith the southwesterly airstream becoming active and under the influence of the upper-air disturbances, the weather will be unsettled and showers will be heavy at times over the coast of Guangdong during the weekend to early next week.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/f993a6d6cd7c3f8d6c030404df00acba/2025-07/Screenshot_2025-07-31_at_7_00_39_AM.png",
    "sponsored": false,
    "id": "4af906249cee86a6"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/307834/HKO-says-tsunami-waves-too-low-to-be-observed",
    "headline": "HKO says tsunami waves 'too low to be observed'",
    "date": "2025-07-30T13:51:45.000+0800",
    "body": "The Observatory said the tsunami waves generated by the 8.8-magnitude earthquake in Russia \"should have reached Hong Kong by now\", but the tsunami heights of the first couple of waves were \"too low to be observed.\"\n\nThe forecaster said it will continue monitoring the arrival of subsequent tsunami waves on Wednesday night.\n\nThe Observatory earlier expected the waves to exceed the normal tide level by around 0.1 metre or less and to recur at intervals of 5 to 60 minutes.\n\nHigh water 1.82 metres  at 12.46 pmLow water 0.82 metre at 6.58 pm\n\nKujiko, Honshu, Japan: 1.3 metresHachijojima, Japan: 0.8 metresNakanoshima, Japan: 0.4 metres\n\n(Updated at 6.28pm)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/4d722cff889c1a73d8977829b0dc9fd2/2025-07/20250110154719224774indexPhoto.jpg",
    "sponsored": false,
    "id": "7829e454873b1df1"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/307803/Workers-at-stricken-Fukushima-nuclear-plant-evacuate-after-tsunami-warning-operator",
    "headline": "Workers at stricken Fukushima nuclear plant evacuate after tsunami warning: operator",
    "date": "2025-07-30T10:23:34.000+0800",
    "body": "Workers at the stricken Fukushima nuclear plant in northeast Japan were evacuated Wednesday after an 8.7-magnitude earthquake off Russia's far east triggered tsunami warnings around the Pacific.\n\n\"We have evacuated all workers and employees\" at the Fukushima Daiichi plant -- which went into meltdown after being hit by a tsunami in 2011 -- a spokeswoman for plant operator TEPCO told AFP, adding that \"no abnormality\" had been observed at the site.\n\nJapan's Chief Cabinet Secretary Hayashi Yoshimasa said no irregularities at nuclear facilities so far after the earthquake.\n\nThis came after the powerful magnitude earthquake off Russia's far east has prompted tsunami alerts across parts of the Pacific including Japan, Hawaii, Russia and Ecuador, and warnings along the California coast.\n\nThe massive temblor triggered warnings of waves up to three metres (10 feet) possibly hitting the coasts of Russia, Hawaii and even Ecuador and Chile along South America's west coast, according to the US Pacific Tsunami Warning Center based in Honolulu, Hawaii.\n\nThe United States further sounded the alarm with a series of alerts of varying levels along North America's West Coast, from Alaska down to the entire coast of California.\n\nJapan's weather agency also upgraded its tsunami warning Wednesday Tokyo time after the magnitude of the quake off Russia's Kamchatka Peninsula was boosted by the USGS to 8.7 from an initial 8.0, saying waves of up to three metres were expected.\n\n\"A tsunami advisory has been issued as of 08:37 (2337 GMT) on July 30,\" the Japan Meteorological Agency said on X, warning that \"tsunamis will strike repeatedly. Do not enter the sea or approach the coast until the warning is lifted.\"\n\nTsunamis of up to one metre were expected to hit between 10:00 am and 11:30 am (0100-0230 GMT), public broadcaster NHK said, calling for residents to stay away from coasts and riversides.\n\nAdvisories were also put out for the US island territory of Guam, and tsunami alerts were pushed to mobile phones in California, according to local AFP reporters.\n\n\"Tsunami waves reaching more than 3 meters above the tide level are possible along some coasts of northwestern Hawaiian islands... and Russia,\" the Pacific Tsunami Warning Center said, describing the potential conditions as \"hazardous.\"\n\nAt least six aftershocks have further rattled the region, including one of 6.9 magnitude and another listed at 6.3.\n\nThe epicenter of the earthquake is roughly the same as a massive 9.0 temblor in 1952 which resulted in a destructive, Pacific-wide tsunami, according to the USGS.\n\n(AFP)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/a8de9dad19c5cc7bd9a5f359ec1b80e6/2025-07/AFP__20250730__689H6WF__v1__HighRes__JapanRussiaQuakeTsunami.jpg",
    "sponsored": false,
    "id": "bdaf6304d0888623"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/307802/Up-to-3m-tsunami-waves-predicted-to-reachJapan-after-87-magnitude-quake-in-Russia",
    "headline": "Up to 3m tsunami waves predicted to reach Japan after 8.7-magnitude quake in Russia",
    "date": "2025-07-30T10:09:32.000+0800",
    "body": "This is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nThe first tsunami from the 8.7-magnitude earthquake off Russia's far east that sparked warnings around the Pacific was observed in northern Japan, measuring around 30 centimetres, broadcaster NHK reported.\n\nThe wave hit the main northern island of Hokkaido, with NHK warning that subsequent waves could be much higher.\n\nThe Japan Weather Agency said it expected tsunami waves of up to 3 metres to reach northern and eastern coasts of Japan, as far as Wakayama south of Osaka, starting around 0100 GMT. Public broadcaster NHK said evacuation orders had been issued by the government for some areas.\n\nDue to the earthquake and the tsunami warning, Japan East Railway announced that the train services along the coast have been suspended until further notice.\n\nSeveral people were injured in the remote Russian region after the quake, while much of Japan's eastern seaboard - devastated by a powerful earthquake and tsunami in 2011 - was ordered to evacuate.\n\n(Staff reporter, Reuters and AFP)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/bdcd840f48cccb23e2d26e213d11b68f/2025-07/2025-07-30T050553Z_477090076_RC2QWFAAIEC4_RTRMADP_3_RUSSIA-QUAKE-PENINSULA-JAPAN_0.JPG",
    "sponsored": false,
    "id": "be20aac589b6adf3"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/hong-kong-news/article/307708/More-than-100mm-rainfall-recorded-under-first-Black-rainstorm-warning-this-year",
    "headline": "More than 100mm rainfall recorded under first Black rainstorm warning this year",
    "date": "2025-07-29T11:00:01.000+0800",
    "body": "The Southern District and Lamma Island have recorded more than 100 millimeters of rainfall as the Observatory issued the first Black rainstorm warning signal of the year this morning.\n\nUnder the influence of an area of intense thundery showers over a broad trough of low pressure, a severe rainstorm is impacting Hong Kong with multiple flooding reports across the city.\n\nMore than 70 millimeters of rainfall were recorded over many places, and rainfall even exceeded 150 millimeters over Hong Kong Island and Sai Kung district.\n\nThe Education Bureau announced that classes at all PM schools are suspended, while AM schools and whole-day schools that are in session should continue until the end of school hours.\n\nThe Black rainstorm warning signal was issued at 9.10 am, and the forecaster lowered the warning signal to Red at 11.05am.\n\nAccording to MTR Corporation, the B3 exit at Wong Tai Sin station, the A2 exit at Sham Shui Po station, and the A1 exit at Choi Hung are being closed due to heavy rain, as preventative measures against flooding are in place.\n\nMembers of the public are urged to stay on high alert and take necessary precautions to reduce their exposure to risk posed by the heavy rain and flooding.\n\n(Updated at 11.10am)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/62131dc40e7fa1b837b98959d8529bf5/2025-07/RAIN_0.jpg",
    "sponsored": false,
    "id": "f263e64f7b8bc726"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/breaking-news/article/307659/At-least-6-dead-in-mass-shooting-at-market-in-Bangkok-Thai-police",
    "headline": "At least 6 dead in 'mass shooting' at market in Bangkok: Thai police",
    "date": "2025-07-28T15:06:05.000+0800",
    "body": "He said the suspect took his own life after the shooting and police were working to identify him, as well as investigating \"for any possible link\" to the current border clashes between Thailand and Cambodia.\n\nThe Or Tor Kor Market is situated a short distance from Chatuchak Market, a major tourist destination in Bangkok that throngs with visitors every weekend.\n\nMass shootings are not uncommon in Thailand, where firearms can be obtained relatively easily due to lax gun control enforcement.\n\n(AFP and Reuters)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/671c6a0873eb337a1def2686ddcbdc5d/2025-07/New_Projec5625265656.jpg",
    "sponsored": false,
    "id": "693dc9f507a8e988"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/breaking-news/article/307676/Thailand-and-Cambodia-agree-to-ceasefire-after-five-days-of-fighting",
    "headline": "Thailand and Cambodia agree to ceasefire after five days of fighting",
    "date": "2025-07-28T18:01:46.000+0800",
    "body": "Nearly 300,000 people have fled as the two sides fired artillery, rockets and guns in a battle over the long-disputed area, which is home to a smattering of ancient temples.\n\nThe flare-up was the deadliest since violence raged sporadically from 2008-2011 over the territory, claimed by both sides because of a vague demarcation made by Cambodia's French colonial administrators in 1907.\n\nReading a joint statement from the leaders of both countries after peace talks, Malaysian Prime Minister Anwar Ibrahim said they had agreed \"an immediate and unconditional ceasefire\" with effect from midnight Monday (1700 GMT).\n\n\"This is a vital first step towards de-escalation and the restoration of peace and security,\" he said at a press conference in Malaysia's administrative capital Putrajaya, flanked by Thai acting Prime Minister Phumtham Wechayachai and Cambodia's Prime Minister Hun Manet.\n\nAnwar said a meeting of military commanders from both sides would take place on Tuesday morning, before the countries' cross-border committee would meet in Cambodia on August 4.\n\nAs the deal was being announced, an AFP journalist in the Cambodian city of Samraong -- 17 kilometres (10 miles) from the fraught frontier -- reported hearing continuing artillery blasts.\n\nBut locals expressed relief that a truce had been struck.\n\n\"I am very happy with the ceasefire. This will let people go back home and children go back to school,\" 48-year-old Cambodian vendor Soeung Chhivling told AFP. \"Please stop the clashes.\"\n\nUS President Donald Trump -- who both nations are courting for trade deals to avert the threat of eye-watering tariffs -- intervened over the weekend, and said both sides had agreed to \"quickly work out\" a truce.\n\n\"Today we had a very good meeting and very good results,\" said Cambodia's Hun Manet, thanking Trump for his \"decisive\" support and saying the truce would serve as \"a foundation for future de-escalation\".\n\nAhead of the summit, Thailand and Cambodia had traded fresh fire and barbed accusations.\n\nCambodia's defence ministry spokeswoman Maly Socheata said it was \"the fifth day that Thailand has invaded Cambodia's territory with heavy weapons and with the deployment of a lot of troops\".\n\nAnd as he departed Bangkok airport, Phumtham told reporters he did not believe Cambodia was \"acting in good faith\".\n\nAfter the talks hosted by Anwar -- chair of the ASEAN bloc of which both Thailand and Cambodia are members -- Phumtham called for the truce to be \"carried out in good faith by both sides\".\n\n\"Thailand decides for peaceful resolution, while continuing to protect our sovereignty and the lives of our people,\" he said.\n\nOn the eve of the talks, Thailand's military said Cambodian snipers were camped in one of the contested temples, and accused Phnom Penh of surging troops along the border and hammering Thai territory with rockets.\n\nIt said there was fighting at seven areas in the rural region, marked by a ridge of hills surrounded by wild jungle and fields where locals farm rubber and rice.\n\n\"The situation remains highly tense, and it is anticipated that Cambodia may be preparing for a major military operation prior to entering negotiations,\" the Thai military statement read.\n\nThai King Maha Vajiralongkorn marked his 73rd birthday on Monday, but a notice in the country's Royal Gazette said his public celebrations scheduled for Bangkok's Grand Palace had been cancelled amid the strife.\n\nTrump has threatened both countries with high levies in his global tariff blitz unless they agree to independent trade deals -- but said he would \"look forward\" to signing them once \"peace is at hand\".\n\nEach side had already agreed to a truce in principle, while accusing the other of undermining peace efforts and trading allegations about the use of cluster bombs and targeting of hospitals.\n\nThailand says nine of its soldiers and 14 civilians have been killed, while Cambodia has confirmed eight civilian and five military deaths.\n\nThe Thai military said it had returned the bodies of 12 Cambodian soldiers killed in combat.\n\nMore than 138,000 people have fled Thailand's border regions, while around 140,000 have been driven from their homes in Cambodia.\n\n(AFP)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/efa4dec935090795d45970f7e7916ed0/2025-07/2025-07-28T095545Z_1517627299_RC2LVFA1PMVZ_RTRMADP_3_THAILAND-CAMBODIA-MALAYSIA.JPG",
    "sponsored": false,
    "id": "ede3eac63cacf499"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308528/World-Games-2025-opens-in-Chengdu-with-celebration-of-culture-and-unity",
    "headline": "World Games 2025 opens in Chengdu with celebration of culture and unity",
    "date": "2025-08-07T23:24:47.000+0800",
    "body": "Chinese State Councillor Shen Yiqin declared the 12th edition of The World Games open Thursday night at the Tianfu International Convention Center in Chengdu, against a backdrop of the city skyline, tranquil lake waters and lush greenery.\n\nBeneath the \"Tianfu Roof\" - Asia's largest single wooden structure, stretching 430 meters - around 10,000 spectators erupted in cheers as Shen Yiqin, joined by International World Games Association (IWGA) President Jose Perurena and International Olympic Committee (IOC) Executive Board Member Li Lingwei, officially opened the Games.\n\nThe opening ceremony reached its climax when the final two torchbearers - Chinese waterskiers Xu Lu and Alu Xiaobo - glided across the water behind powerboats, carrying torches passed to them by snooker player Ding Junhui and Olympic and TWG trampoline champion Dong Dong. Xu and Alu then lit the main cauldron, designed as a water-shaped spout rising from the lake, as fireworks lit up the sky in a dazzling display.\n\nRunning from August 7 to 17 under the slogan \"Boundless Sports, Countless Wonders,\" the 12th World Games marks the first time the event is hosted on the Chinese mainland. It follows Chengdu's successful staging of the 31st FISU World University Games in 2023.\n\nIn another first, the Chengdu Games hosted a torch relay on July 26 at the Sanxingdui Museum - the cultural heart of Sichuan Province - where 120 torchbearers took part in the historic moment.\n\nAs the largest-ever edition, the Chengdu World Games has attracted a record 6,679 athletes and officials from 116 countries and regions and the 3,942 athletes will compete in 256 events across 34 sports.\n\nChina has sent its largest-ever delegation: 489 members, including 321 athletes. The Chinese athletes, which has also included para-athletes for the first time, are competing in 152 events across 28 sports and making its debut in 12, including cheerleading, flying disc and powerboating.\n\nIn a video message, IOC President Kirsty Coventry sent greetings to athletes, officials and fans.\n\n\"I'd like to take a moment to thank the Chinese organizers for their professionalism and hospitality as usual, seamless organization and legendary Chinese efficiency,\" Coventry said. \"Thank you to the Chinese Olympic Committee, China Sport Authorities, local and national authorities for their unwavering support, and of course, the people of Chengdu and the volunteers for all their enthusiasm and contributions.\"\n\nIn his speech, Perurena praised Chengdu, saying its \"dedication has gone beyond all expectations.\"\n\n\"Thank you for your vision, your tireless efforts, and your deep belief in the values that The World Games stand for. Chengdu, you are not just the host - you are the heart of these Games,\" Perurena said.\n\nAs Chengdu 2025 marks his final edition of The World Games as IWGA president, Perurena added: \"I can think of no greater farewell than standing here in Chengdu, at the center of global sport.\"\n\nGao Zhidan, president of both the Chengdu World Games Organizing Committee and the Chinese Olympic Committee, said Chengdu is committed to delivering a \"simple, safe and splendid\" edition of the Games, guided by principles of openness, inclusiveness and cooperation.\n\n\"We hope that hosting The World Games will effectively drive nationwide fitness initiatives, invigorate the sports industry, boost urban development and enable the benefits of sports development to reach a broader range of people,\" Gao said.\n\nNo new venues were built for the Games. Organizers instead utilized legacy facilities from the Universiade, upgrading 18 existing venues and setting up nine temporary ones in lake parks, for a total of 27 competition sites.\n\nThe gala performance, titled \"Splendor Woven Together,\" featured four acts of Chinese dance that highlighted traditional cultural elements, including the Sun and Immortal Birds, rapping figurines, the Twenty-Four Musical Performers, and Sichuan opera face-changing. The show emphasized the unique cultural inclusiveness of the Ba-Shu region.\n\nThe ceremony concluded with a soothing musical finale as performers joined an international children's choir in singing the TWG theme song, \"Countless Wonders,\" capturing the spirit of global unity and celebration that defines the Games.\n\n(Xinhua)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/7e676ae971774c614ca1d2255e3e2c71/2025-08/20250807761248b0e5bf4f2c9474086e2ef6bc21_20250807a348435e3e21459f8a5b006afc7b05d1.jpg",
    "sponsored": false,
    "id": "5e5b15ef9c71f774"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308481/Migrant-worker-found-dead-on-high-voltage-power-tower-in-Taoyuan",
    "headline": "Migrant worker found dead on high-voltage power tower in Taoyuan",
    "date": "2025-08-07T16:55:58.000+0800",
    "body": "A man was found dead on Wednesday, hanging from a 60-meter-high (197-foot) transmission tower in Taoyuan’s Guishan District, according to the Taiwanese news media.\n\nThe structure, as tall as a 20-story building, carries high-voltage power lines, making the recovery operation complex.\n\nTaiwan Power Company (Taipower) confirmed the deceased was not an employee, and his identity remains under investigation.\n\nPolice preliminarily ruled out foul play, noting he appeared to have been suspended by an unidentified material around his neck.\n\nInitial reports suggest the man, believed to be a migrant worker in his 30s or 40s, had been missing for three days before his body was discovered.\n\nA coworker had reported his disappearance, and investigators later traced his phone signal to the tower, leading to the grim find.\n\nThe Taoyuan Fire Department was alerted yesterday afternoon (Aug 6) after the body was spotted on power lines behind the Longshou Industrial Zone.\n\nDue to the danger of high-voltage electricity, Taipower cut the power supply early this morning to allow recovery efforts.\n\nRescue teams first deployed a drone to assess the situation before sending four personnel to climb the tower.\n\nBy 9am, they reached the body and secured it with ropes, lowering it to the ground around 10am.\n\nThe deceased man is believed to have died due to material entangled around his neck. Authorities have indicated that there are no signs of foul play.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/dada5dd289a676ad955dd7d55ab0fc5d/2025-08/20250806004150_20250806184032.jpg",
    "sponsored": false,
    "id": "ddc1ce4bcd0a75d7"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308455/5-dead-24-injured-in-suspension-bridge-accident-in-Xinjiang",
    "headline": "5 dead, 24 injured in suspension bridge accident in Xinjiang",
    "date": "2025-08-07T12:59:42.000+0800",
    "body": "This is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nA suspension bridge accident at a scenic spot in northwest China's Xinjiang Uygur Autonomous Region left five people dead and 24 others injured, local authorities said Wednesday (Aug 6).\n\nThe accident occurred at 6:18 p.m. on Wednesday in Zhaosu County, northern Xinjiang's Ili Kazak Autonomous Prefecture, when one of the bridge's suspension cables snapped, causing the bridge deck to tilt. A total of 29 people fell from the bridge.\n\nAmong the injured, 22 sustained minor injuries, while two others were seriously hurt. All injured individuals were promptly transported to local hospitals for medical treatment. Authorities said none of the injured are in life-threatening condition.\n\nThe scenic spot has been closed. An investigation into the cause of the accident is currently underway.\n\n(Xinhua)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/73156848c7d7258913b05b550d746567/2025-08/XJ.jpg",
    "sponsored": false,
    "id": "3af7e9d30961faff"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308480/Shopping-for-a-robot-Chinas-new-robot-store-in-photos",
    "headline": "Shopping for a robot? China's new robot store in photos",
    "date": "2025-08-07T16:47:18.000+0800",
    "body": "A high-tech district in the Chinese capital is opening an all-service robot store on Friday to push a national drive to develop humanoid robots.\n\nFrom plucking boxes off a pharmacy shelf to serving drinks from behind a bar, robots at the government-run facility showcase how far humanoid robot development has come — and how far it has to go.\n\nThe goal is to help robotics companies commercialize what has been largely a research-focused endeavor to date. China has produced eye-catching shows of two-legged robots dancing in sync, but can they be put to practical use?\n\n“With the mass production of humanoid robots, we believe that both enterprises and customers will face pain points,” said Wang Yifan, the director of the Robot Mall in Beijing E-Town, about 40 minutes southeast of downtown by car.\n\nMany of the companies have no experience in sales and marketing and there are few opportunities to display their products, he told a pack of journalists at a media preview this week.\n\nThe four-story facility is dubbed a 4S store, meaning sales, service, spare parts and surveys — or collecting and analyzing customer feedback. It is the first such store in China, though other cities are building them too, Wang said.\n\nBesides those performing tasks, the robots on display include ones that play soccer or Chinese chess, as well as historical figures from scientists Albert Einstein and Isaac Newton to Li Bai, considered one of China's greatest poets.\n\nRobots, showing perhaps a humanlike tendency, are not infallible.\n\nOne was designed to recognize and separate trash from dishware returned by customers at a cafe. Its hand picked up a coffee cup and swung to one side but then held the blue-green mug in the air, not putting it down on a tray. A worker intervened to reset the software.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/dd130d0ee12e8744b7deab963b9a7588/2025-08/o_1.jpg",
    "sponsored": false,
    "id": "f260994dda0835aa"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308446/UK-asks-China-to-clarify-contested-embassy-plan",
    "headline": "UK asks China to clarify contested embassy plan",
    "date": "2025-08-07T11:59:05.000+0800",
    "body": "The British government on Wednesday asked China explain partially redacted plans it has submitted for its new London embassy project, which has fanned worries from residents and human rights advocates.\n\nChina has sought for several years to move its embassy from the chic Marylebone district to a sprawling historic site in the shadow of the Tower of London.\n\nIt would be the largest embassy complex in Britain, and the project comes as the Labour government is looking to reset long-fraught ties with Beijing.\n\nOn Wednesday, Deputy Prime Minister Angela Rayner sent a letter to the firm DP9 that represents the Chinese government, requesting details on some documents transmitted during a public inquiry.\n\nRayner sought in particular details on portions of the plans that had been \"greyed-out\" or \"redacted for security reasons\".\n\nThe letter was published online by Luke de Pulford of the Interparliamentary Alliance on China, an international body, one of its copied recipients.\n\nThe UK government gave China until August 20 to respond.\n\nThe proposed embassy site, which Beijing bought in 2018 for a reported $327 million, once housed the Royal Mint.\n\nIt was earlier home to a Cistercian abbey built in 1348 but is currently derelict.\n\nIn 2022, the local authority, Tower Hamlets Council, unanimously rejected China's plans, which include designs by the renowned firm David Chipperfield Architects.\n\nIn July 2024, Beijing resubmitted the proposals almost entirely unchanged.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/7bca028515dc7cdf502c4ae1d8717a53/2025-08/a_1.jpg",
    "sponsored": false,
    "id": "26d19a36c17a767f"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308440/Tokyo-Electron-confirms-Taiwan-unit-employees-involvement-in-intellectual-property-case",
    "headline": "Tokyo Electron confirms Taiwan unit employee's involvement in intellectual property case",
    "date": "2025-08-07T10:37:26.000+0800",
    "body": "Tokyo Electron Ltd said on Thursday a former employee of its Taiwan subsidiary was involved in a case cited by the Intellectual Property Branch of the Taiwan High Prosecutors Office on Tuesday.\n\nTaiwanese authorities have detained three people for allegedly stealing technology trade secrets from Taiwan Semiconductor Manufacturing Co (TSMC), the world's largest chip foundry, Taiwanese prosecutors said on Tuesday.\n\nTokyo Electron, a Japanese chip-making machinery maker, said in a statement it has dismissed the employee involved and that its internal investigation has found no evidence of confidential information being shared with third parties.\n\nTokyo Electron said it is fully cooperating with authorities in the investigation, but declined to disclose further information, saying \"the case is now under judicial review\".\n\nNikkei Asia earlier reported that the breach involved suspected attempts to obtain critical proprietary information on TSMC's 2-nanometer chip technology.\n\nShares of Tokyo Electron closed the morning session down 3.2%, while the benchmark Nikkei average rose 0.8%.\n\nReuters",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/b4fcdd6a0bdf4615deff11c08b6f6d28/2025-08/d.JPG",
    "sponsored": false,
    "id": "793deb51c1d50b28"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308403/Dogs-of-war-China-touts-killer-robot-wolves",
    "headline": "Dogs of war: China touts killer robot 'wolves'",
    "date": "2025-08-06T18:50:02.000+0800",
    "body": "China's latest gun-toting quadruped military \"wolf\" robots are designed to stealthily approach enemies, fire precise shots on targets and work in rough terrain, state media said on Wednesday.\n\nState broadcaster CCTV said the robots, an upgrade from earlier robotic dog iterations, can replace human soldiers in dangerous conditions to reduce combat casualties.\n\nChina has poured support into robotics, an area in which some experts say it might already have the upper hand over the United States.\n\nIts military has been keen to showcase its defence innovation -- including weapons incorporating advanced technology like robodogs -- during drills with countries like Cambodia.\n\nIn a video posted by CCTV on Wednesday, the newest iteration of the robot \"wolves\" carries a rifle on its back, marching into a smoke-filled battlefield.\n\nThe agile machines climb up flights of stairs, carry heavy backpacks and launch attacks on dummies, clips showed.\n\nWhile they look almost identical to the military's robodogs, the \"wolves\" have improved \"reconnaissance and strike capabilities\", CCTV said.\n\n\"They can navigate various terrains and carry out precision strikes from up to 100 meters (328 feet) away,\" it added.\n\nDuring war, the robots would be able to operate like a real wolf pack, dividing tasks and coordinating with each other, state media said.\n\nAt the front of the unit would be the \"pack leader\", responsible for gathering target information and transmitting reconnaissance imagery, CCTV said.\n\nOthers would be in charge of shooting at enemies or carrying supplies and ammunition, it added.\n\nThese new robots could signal that the future battlefield will be more automated and deadly, said Chong Ja Ian, an associate professor at the National University of Singapore.\n\nIt is \"in part to instill national pride domestically, but also to intimidate potential adversaries externally\", Chong said.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/1c238c401069bef2dcc0a0b46ca77edd/2025-08/j_1.jpg",
    "sponsored": false,
    "id": "19550b7e02a3ba1f"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308389/China-says-extends-probe-into-beef-imports",
    "headline": "China says extends probe into beef imports",
    "date": "2025-08-06T18:20:54.000+0800",
    "body": "China has extended a months-long investigation into whether beef imports had harmed the domestic industry, the commerce ministry said Wednesday.\n\nThe price of beef in China has trended downwards in recent years, with analysts blaming oversupply and a lack of demand as the world's second largest economy has slowed.\n\nAt the same time imports have surged, with China representing a hugely important market for countries such as Brazil, Argentina and Australia.\n\nThe commerce ministry said in December it had launched an investigation into imported beef at the request of representatives from its struggling domestic industry.\n\nA sharp increase in beef imports in recent years \"has had a significant adverse impact on the domestic industry\", the commerce ministry said, quoting local associations.\n\nThe probe was meant to last eight months, but could be extended \"under special circumstances\", according to the initial announcement.\n\nAnd on Wednesday, the ministry announced it was extending the probe.\n\n\"Due to the complexity of this case, the Ministry of Commerce has decided to extend the investigation period of this case to November 26, 2025,\" it said.\n\nIn a separate statement, a ministry spokesperson added that the investigation carried a large workload.\n\nThe case has \"attracted widespread attention\" with exporting countries, livestock farmers and industry associations submitting materials, the ministry said.\n\nInvestigators were reviewing opinions from all parties and \"carefully assessing\" whether the case meets the bar for \"implementing safeguards\", it said.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/6d77211b0bd5c239cb72795fb90c9622/2025-08/o_0.jpg",
    "sponsored": false,
    "id": "61126baa85a64be1"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308402/Thirteen-year-old-Chinese-girl-kills-classmate-in-Australian-homestay",
    "headline": "Thirteen-year-old Chinese girl kills classmate in Australian homestay",
    "date": "2025-08-06T17:51:52.000+0800",
    "body": "Anson Luk\n\nA 13-year-old Chinese student allegedly stabbed and killed a 14-year-old Chinese classmate at a homestay in Australia, where she was arrested and charged with murder.\n\nThe case occurred at 10.20pm on Monday (Aug 4) at Edgeworth, New South Wales, as the host family of the homestay heard a disturbance and found the 14-year-old girl with knife injuries to her chest. She was pronounced dead after being rushed to the hospital.\n\nA kitchen knife was seized as evidence.\n\nThe 13-year-old female suspect was arrested on the scene and will face trial in a children's court.\n\nInvestigation showed that both girls arrived in late July under the same exchange program and were set to return to China on August 16.\n\nPolice officers said no prior relationship between the girls, beyond sharing the homestay, has been confirmed.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/7ee5f6d79b43614ccff52ffaeaa13f7e/2025-08/afp_media_image_generic_7.jpg",
    "sponsored": false,
    "id": "6bb262e2e97f43ad"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308396/US-lawmaker-questions-Intel-CEOs-ties-to-China-in-letter-to-company-board-chair",
    "headline": "US lawmaker questions Intel CEO's ties to China in letter to company board chair",
    "date": "2025-08-06T18:09:35.000+0800",
    "body": "U.S. Republican Senator Tom Cotton sent a letter to Intel's board chair on Wednesday with questions about the chipmaker's new CEO Lip-Bu Tan's ties to Chinese firms and a recent criminal case involving his former company Cadence Design.\n\nWriting to \"express concern about the security and integrity of Intel's operations and its potential impact on U.S. national security\", Cotton asked in the letter to Intel chairperson Frank Yeary whether the company's board was aware of the subpoenas sent to Cadence during Tan's time there as CEO before Intel hired him. Cotton asked what measures were taken to address those concerns.\n\nHe also asked whether Intel's board required Tan to divest from chip firms in China linked to the Chinese military or Communist Party, and if Tan adequately disclosed other ties to Chinese companies due to Intel's involvement in the Secure Enclave program, an initiative designed under the Biden administration to ensure a secure supply of microelectronics for defense.\n\nBecause of Intel getting federal funding under the initiative, Cotton questioned Yeary in the letter about Tan's disclosures related to investment, professional roles or other ties to Chinese companies.\n\n\"Intel is required to be a responsible steward of American taxpayer dollars and to comply with applicable security regulations,\" Cotton wrote. \"Mr. Tan's associations raise questions about Intel's ability to fulfill these obligations.\"\n\nIn a statement, an Intel spokesperson said, \"Intel and Mr. Tan are deeply committed to the national security of the United States and the integrity of our role in the U.S. defense ecosystem.\" The company said it would address the matters in the letter with the Senator.\n\nIn April, Reuters reported Tan - himself or through venture funds he has founded or operates - has invested in hundreds of Chinese companies, some of which are linked to the Chinese military. The Intel CEO invested at least $200 million in hundreds of Chinese advanced manufacturing and chip firms between March 2012 and December 2024, Reuters found.\n\nA source familiar with the matter had at the time told Reuters that Tan had divested from his positions in entities in China, without providing further details. Chinese databases reviewed by Reuters at the time had listed many of his investments as current, and Reuters was at the time unable to establish the extent of his divestitures.\n\nCotton's letter mentioned the Reuters story as a source.\n\nIt is not illegal for U.S. citizens to hold stakes in Chinese companies, even those with ties to the Chinese military, unless those companies have been added to the U.S. Treasury's Chinese Military-Industrial Complex Companies List, which explicitly bans such investments. Reuters in April had found no evidence that Tan at the time was invested directly in any company on the U.S. Treasury's list.\n\nSeparately, last week Cadence Design agreed to plead guilty and pay more than $140 million to resolve charges for selling its chip design products to a Chinese military university, Reuters reported. The institution was believed to be involved in simulating nuclear blasts.\n\nIn a filing with the Securities and Exchange Commission, Cadence said it was \"pleased\" to reach settlements with the Justice and Commerce departments.\n\nTan ran Cadence as CEO from 2008 through 2021 and was executive chairman until May 2023. The sales to Chinese entities occurred under his leadership at Cadence, which makes design software and other tools used to create chips.\n\nReuters",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/d7bc875b04e20cb9dcfb31a5563f1025/2025-08/m_0.jpg",
    "sponsored": false,
    "id": "aa0cd67cddaf23ab"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308390/Flash-floods-kill-6-in-Myanmar-China-border-town",
    "headline": "Flash floods kill 6 in Myanmar-China border town",
    "date": "2025-08-06T17:26:57.000+0800",
    "body": "Monsoon floods in a rebel-held Myanmar town on the country's mountainous border with China have killed six people, a spokesman for the armed group controlling the area said Wednesday.\n\nThe northern town of Laiza bordering China's Yunnan province has reported flash flooding since early Monday, when muddy waist-high waters began to stream through the streets.\n\nLaiza is a stronghold of the Kachin Independence Army (KIA), which has for decades commanded control of its own ethnic enclave and emerged as one of the most powerful factions in Myanmar's civil war.\n\n\"A lot of water flowed down the mountain to the river,\" said KIA spokesman Naw Bu.\n\n\"The flow of water was too strong and destroyed areas surrounding the river,\" he added. \"Six people were killed in the flood and 100 houses were destroyed.\"\n\nRescue operation had begun on Wednesday, he said, but were being hampered by road blockages.\n\n\"All of the roads have been damaged and the roads disappeared in some areas,\" said one resident, who declined to be named for security reasons. \"The water rose suddenly.\"\n\nMore than 3.5 million people are currently displaced in Myanmar amid the civil war sparked by a 2021 coup, many sheltering in temporary camps, leaving them exposed to the elements.\n\nThe resident said flooding was \"terrible\" around local camps for the displaced where some shelters had been swept away and people had been wounded.\n\nMyanmar is in the midst of its monsoon season when daily deluges are common.\n\nBut scientists say hazardous weather events are becoming more frequent and severe around the world as a result of human-driven climate change.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/0e008ef75f2400f5fcd48a45c253831a/2025-08/n_1.jpg",
    "sponsored": false,
    "id": "6f632c58b5fb4a18"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308360/South-Korea-to-offer-visa-fee-entry-to-Chinese-tourists-from-late-September",
    "headline": "South Korea to offer visa-fee entry to Chinese tourists from late September",
    "date": "2025-08-06T14:34:31.000+0800",
    "body": "South Korea will offer visa-free entry to tourist groups from China, for a temporary period from September 29 through June 2026, to boost foreign tourism ahead of an Asia-Pacific summit, the government said on Wednesday.\n\nThe visa-free offer was first announced in March after China's decision last November to offer a visa exemption to South Koreans and foreign visitors from other countries.\n\nIt also comes amid expectations that ties between the two countries will improve under the new South Korean administration of liberal President Lee Jae Myung.\n\nThe decision to introduce the measure ahead of a Chinese holiday period in early October will help boost the domestic economy amid a recovery in foreign visits, the tourism ministry said, after a meeting to discuss measures to revitalise tourism ahead of the Asia-Pacific summit.\n\nSouth Korea will host a summit of leaders from 21 economies for the Asia-Pacific Economic Cooperation (APEC) forum from October 31 to November 1 in the southeastern city of Gyeongju, a gathering where Chinese leader Xi Jinping and U.S. President Donald Trump might hold separate talks.\n\nShares of South Korean department stores, casinos, hotels and beauty product makers rallied on hopes of a boost from Chinese demand.\n\nHyundai Department Store shares jumped 7.1%, Hotel Shilla rose 4.8%, casino operator Paradise climbed 2.9% and Hankook Cosmetics surged 9.9%.\n\nReuters\n\nUpdated 3.42pm",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/7c7fd284640187dc3be0692faea986b7/2025-08/u_0.jpg",
    "sponsored": false,
    "id": "d8acdd13915dcab2"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308383/Taiwans-orchid-growers-dig-in-as-US-tariffs-shoot-up",
    "headline": "Taiwan's orchid growers dig in as US tariffs shoot up",
    "date": "2025-08-06T16:50:54.000+0800",
    "body": "Since the start of US President Donald Trump's global trade war, Taiwanese orchid grower Lee Tsang-yu has watched tariffs on his seedlings shoot from nothing to 20 percent.\n\nBut, after weathering many economic crises, the 61-year-old seasoned farmer is digging in.\n\nLee is cultivating new markets in Thailand and expanding in Vietnam, Indonesia and Brazil, while cutting back shipments to the United States.\n\n\"The US is such a huge market, we can't pull out, and we won't,\" said Lee, whose company, Charming Agriculture, operates four rugby field-sized greenhouses in Houbi, a district of the southern city of Tainan.\n\nTaiwan's more than 300 orchid growers rank among the world's biggest producers of the thick-leaved plants, with Phalaenopsis orchids, also known as moth orchids, dominating exports.\n\nThe island's orchid shipments reached NT$6.1 billion (US$204 million) in 2024, with about NT$2 billion worth of plants sent to the United States, its biggest market, official data shows.\n\nUntil now, most growers have been absorbing the cost of the 10 percent tariff that Trump slapped on nearly every trading partner in April, said Ahby Tseng, 53, secretary-general of the Taiwan Orchid Growers Association.\n\nBut \"no one can bear\" all of Trump's temporary 20 percent levy on Taiwan announced last week, he said.\n\nTseng said Taiwan's main rival in the United States was The Netherlands, which has been hit with a relatively lighter 15 percent tariff.\n\nThe five percentage point difference is significant, he said.\n\n\"It is actually very difficult to immediately pass the cost on to consumers because consumers can choose not to buy, or they can choose to buy other types of flowers,\" Tseng said.\n\nAnd stockpiling orchids in a warehouse wasn't an option given that the plants \"keep growing\".\n\nWhile the higher tariff would erode his bottom line, Lee said he was more concerned about the general state of the US economy since Trump took office.\n\n\"Everything has become more expensive in the US, and consumer spending is shrinking -- that's what worries me,\" he said.\n\n\"Since late May, we've already cut shipments by 15 percent. Before that, the US accounted for 45 percent of our exports.\"\n\nLee said he was optimistic his efforts to expand into other markets, though slow and not always as lucrative, would \"gradually offset this impact\".\n\nTaiwan's orchids also had a competitive edge, he said -- their flowers could last longer than Dutch plants.\n\nAnd, he reasons, \"Trump won't be president forever.\"\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/e8241b6b90ba73cb5ee69339604e6686/2025-08/q_0.jpg",
    "sponsored": false,
    "id": "7619eecf575af482"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308356/Monsoon-peaks-in-south-China-unleashing-landslides-disease",
    "headline": "Monsoon peaks in south China, unleashing landslides, disease",
    "date": "2025-08-06T13:38:08.000+0800",
    "body": "Rescue crews raced on Wednesday to clear debris and flooded roads as southern China braced for more extreme rainfall and spreading infection after some of the worst downpours this century, brought by a peak in East Asian monsoon rains.\n\nForecasters warned of more thunderstorms after the century's second-heaviest August rains pounded Guangzhou, the capital of Guangdong province, forcing its Baiyun airport, one of the world's busiest, to cancel 363 flights and delay 311.\n\nThe day before, the skies above Hong Kong and the high-tech cities of China's Pearl River Delta turned livid and dumped the heaviest August rainfall since 1884 on the Asian financial hub.\n\nRescue teams in Guangdong scrambled to open drains and pump water away from urban areas, state media said, as the intense rain set off mudslides and felled trees on highways, ripping up roads to expose cabling and other infrastructure.\n\nVideo images showed roads transformed into brown waterways, threatening to worsen a major outbreak of chikungunya, fuelled by mosquitoes thriving in stagnant flood water, which had been on a downtrend before the latest rains.\n\nGuangdong had reported more than 7,000 of the virus infections earlier.\n\nChina has suffered weeks of atmospheric chaos since July, battered by heavier-than- sual downpours with the East Asian monsoon stalling over its north and south.\n\nWeather experts link the shifting pattern to climate change, testing officials as flash floods displace thousands and threaten billions of dollars in economic losses.\n\nOn Tuesday, Beijing allocated more than 1 billion yuan ($139 million) in disaster relief for Guangdong and the northern province of Hebei, as well as the capital, Beijing, and the northern region of Inner Mongolia, state news agency Xinhua said, including subsidies for damage to grain-growing areas.\n\n\"The rains will drive up prices for fresh fruits and vegetables,\" said Dan Wang, a China expert at Eurasia Group.\n\nWhile some farmers might be able to exploit the situation to their benefit, agricultural losses would hit incomes as a whole, she added.\n\nCold chain storage providers could benefit, she said, while higher prices could sustain consumer prices, after the latest data showed the first rise in five months.\n\nEven e-commerce may not be immune, as a landslide north of Guangzhou early on Wednesday hit 'Taobao Village', a community where many households run shops on China's Alibaba platform, trapping 14 people, with half the number still missing.\n\nAcross the province, 16 rivers threaten to breach their banks, with water levels at two sites reaching their highest since 2017 and 2018.\n\nBut the worst may be yet to come, with two to three typhoons expected to strike in August, emergency management authorities said on Tuesday.\n\nThe city of Foshan west of Guangzhou has been the epicentre of the province's chikungunya outbreak, while at least a dozen more have reported infections, which typically cause fever and severe joint pain, though deaths are rare.\n\nThe next few weeks are especially daunting for disease prevention and control, say provincial authorities, after the flood season, worsened by typhoons and heavy rain, boosted mosquito activity.\n\nSpread by the bite of infected Aedes mosquitoes, global infections of the disease number at least 240,000 this year.\n\nBut the disease and rainfall will have an uneven economic impact on China, thanks to their localised nature, said Chim Lee, a senior analyst at the Economist Intelligence Unit.\n\n\"In harder-hit areas like Guangdong, outdoor activity is discouraged, and many brick-and-mortar, consumer-facing businesses are seeing a drop in footfall,\" he added.\n\n\"Industrial and commercial operations are also feeling the strain.\"\n\nReuters\n\nUpdated 3.37pm",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/577b5eab59d0a8d2d725e690df9a133f/2025-08/x_0.jpg",
    "sponsored": false,
    "id": "0f3f7873897851b2"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/china-news/article/308359/Chikungunya-in-China-What-you-need-to-know",
    "headline": "Chikungunya in China: What you need to know",
    "date": "2025-08-06T13:29:37.000+0800",
    "body": "Cases of chikungunya fever are rising in southern China, prompting local authorities to take measures to curb its spread.\n\nHere is what you need to know about the disease:\n\nChikungunya is caused by a virus that can be passed to humans by infected mosquitoes, with most cases occurring in Africa, Asia and the Americas.\n\nSymptoms include fever and joint pain, which may persist for some time but are rarely fatal.\n\nBecause the symptoms of chikungunya resemble other mosquito-borne diseases like dengue and Zika, it can sometimes be hard to determine the extent of an outbreak.\n\nTwo vaccines for chikungunya have been approved in some countries but are not yet widely used.\n\nInfected people are typically given medicines like paracetamol to ease their symptoms.\n\nMore than 7,700 people in the southern province of Guangdong have been infected in recent weeks, according to an article by the China Association for Science and Technology that was widely carried by state media.\n\nMost cases have occurred in the industrial centre of Foshan, where 2,770 people fell ill between July 27 and August 2, the provincial disease control office said on Sunday.\n\nDozens of infections have also been detected in neighbouring Guangzhou, while semiautonomous Hong Kong reported its first case on Saturday.\n\nChief expert Kang Min said \"the rapid rise of the epidemic has been preliminarily curbed\" in Guangdong, according to a statement from the province's disease control office.\n\nBut Kang warned that officials still faced \"complex and severe challenges\" due to the high risk of imported cases in the international trade hub as well as rain and typhoons that help mosquitoes to thrive.\n\nTop officials in Guangdong agreed at a meeting on Saturday to \"go all out to win the... war of annihilation against the epidemic\", according to an official statement.\n\nThey stressed the need to \"mobilise the public\" to eliminate the conditions in which mosquitoes breed, for example, by removing pots and cans, unblocking ditches and clearing pools of stagnant water.\n\nFootage by state news agency Xinhua showed doctors at a hospital in Foshan's Shunde district tending to a ward of chikungunya patients lying on beds surrounded by mosquito nets.\n\nOther interventions seemed more dramatic.\n\nThe New York Times reported that some infected people in Foshan were \"given no choice\" but to go to hospital, while others had workers enter their homes without consent in search of stagnant water.\n\nState media and local governments have published images of workers in helmets and face masks spraying insecticide in parks, gardens and overgrown buildings, where mosquitoes can linger.\n\nLaw enforcement officers have threatened fines of up to 1,000 yuan ($140) for businesses that do not take adequate steps to prevent mosquitoes from breeding, according to the provincial disease control office.\n\nAnd one subdistrict in Foshan cut power to the homes of some residents who failed to comply with disease controls, according to an online statement from a local government committee.\n\nThe United States has issued a travel advisory urging increased caution when going to affected areas in China.\n\nSome of China's measures evoke its pandemic strategy, when Beijing wielded city-wide lockdowns, lengthy quarantines and travel bans to curb the spread of Covid-19.\n\nBut comparisons to the pandemic are overblown.\n\nUnlike Covid, chikungunya is caused by a known pathogen, is not transmitted via human contact and very rarely proves fatal.\n\nChinese authorities have stressed that the disease is \"preventable, controllable and treatable\" and the World Health Organization has not issued any special guidance on China's outbreak.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/7d5882f344f64bf1cbb6f406ab01dc0f/2025-08/v_0.jpg",
    "sponsored": false,
    "id": "783829da762e8388"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308339/NASA-races-to-put-nuclear-reactors-on-Moon-and-Mars",
    "headline": "NASA races to put nuclear reactors on Moon and Mars",
    "date": "2025-08-06T12:27:33.000+0800",
    "body": "The United States is rushing to put nuclear power reactors on the Moon and Mars, and hopes to launch the first system by the end of the decade.\n\nA new NASA directive -- first reported by Politico and seen by AFP on Tuesday -- calls for the appointment of a nuclear power czar to select two commercial proposals within six months, framing the push as crucial to outpacing a joint Chinese-Russian effort.\n\nSigned by acting NASA chief Sean Duffy, who is also US transportation secretary, the July 31 memo is the latest sign of the agency's shift towards prioritizing human space exploration over scientific research under President Donald Trump's second term.\n\n\"Since March 2024, China and Russia have announced on at least three occasions a joint effort to place a reactor on the Moon by the mid-2030s,\" it says.\n\n\"The first country to do so could potentially declare a keep-out zone which would significantly inhibit the United States from establishing a planned Artemis presence if not there first.\"\n\nThe idea of using nuclear energy off-planet is not new.\n\nSince 2000, NASA has invested $200 million towards developing small, lightweight fission power systems, though none have progressed towards flight readiness, according to the directive.\n\nThe most recent effort came in 2023 with the completion of three $5 million industry study contracts that focused on generating 40 kilowatts of power, enough to continuously run 30 households for ten years.\n\nUnlike solar power, fission systems can operate around the clock -- invaluable during the weeks-long lunar nights or Martian dust storms.\n\nAdvances in technology have made such systems increasingly compact and lightweight.\n\nNASA formally committed to using nuclear power on Mars in December 2024 -- the first of seven key decisions necessary for human exploration of the Red Planet.\n\nBased on feedback by industry, surface power needs should be at least 100 kilowatts to support \"long-term human operations including in-situ resource utilization,\" meaning things like life support, communications, and mining equipment to collect surface ice.\n\nIt assumes the use of a \"heavy class lander\" that carries up to 15 metric tons of mass, and targets a \"readiness to launch by the first quarter of FY30,\" meaning late 2029.\n\nNASA's Artemis program to return to the Moon and establish a lasting presence near the south pole has faced repeated delays.\n\nThe timeline for Artemis 3, the first planned crewed landing, has slipped to 2027, a date few see as realistic given the planned lander, SpaceX's Starship, is far from ready.\n\nChina meanwhile is targeting 2030 for its first crewed mission and has proven more adept at meeting its deadlines in recent years.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/0d6790405f7e4e68683d53b2b76e4638/2025-08/i_0.jpg",
    "sponsored": false,
    "id": "78ebc6da8379e2fd"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308527/Japanese-population-sees-record-drop-in-2024",
    "headline": "Japanese population sees record drop in 2024",
    "date": "2025-08-07T23:14:45.000+0800",
    "body": "Prime Minister Shigeru Ishiba has called the situation a \"quiet emergency\", pledging family-friendly measures like more flexible working hours and free day care to try and reverse the trend.\n\nLast year, the number of Japanese fell by 908,574, or 0.75 percent, to 120.65 million.\n\nThe decline -- for a 16th straight year -- was the largest drop since the survey began in 1968, the internal affairs ministry said Wednesday.\n\nForeign resident totals, however, were at their highest since records began in 2013.\n\nThere were 3.67 million foreigners as of January 1, 2025, representing nearly three percent of the whole population in Japan, which was more than 124.3 million as of that date.\n\nThe overall population of the country declined by 0.44 percent from 2023.\n\nThe latest figures come as the government struggles to raise stubbornly low birth rates, while frustration over inflation and other concerns among some voters prompted the rise of a new opposition party with a slogan of \"Japanese First\".\n\nThe anti-immigrant party has falsely claimed foreigners enjoy more welfare benefits than Japanese nationals.\n\nForeign nationals are helping address labour shortages exacerbated by the ageing population, and most commonly hold jobs in the manufacturing, hospitality and retail sectors.\n\nBy age, Japanese nationals aged 65 and over accounted for nearly 30 percent of the population, while the age group between 15 and 64 made up 60 percent, both minor increases from the previous year.\n\nJapan has the world's second-oldest population after tiny Monaco, according to the World Bank.\n\nThe number of births in Japan last year fell below 700,000 for the first time on record, health ministry data released in June said.\n\nThe fast-ageing nation welcomed 686,061 newborns in 2024 -- 41,227 fewer than in 2023, the data showed. It was the lowest figure since records began in 1899.\n\nThe shrinking population is also gutting rural communities, with the number of abandoned homes in Japan soaring to almost four million over the last two decades, government data released last year showed.\n\nMany of the homes belong to people living in major cities who have inherited them from relatives and who are unable or unwilling to keep them renovated.\n\nThe world's oldest person, Japanese woman Tomiko Itooka, died at the age of 116 in December.\n\nWomen typically enjoy longevity in Japan, but the expanding elderly population is leading to soaring medical and welfare costs, with a shrinking labour force to pay for it.\n\n(AFP)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/af06d65eea8742800c260ae9475e086f/2025-08/p_0_0.jpg",
    "sponsored": false,
    "id": "d13138c8c3aedbd2"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308494/Senior-EU-official-says-Gaza-crisis-looks-very-much-like-genocide",
    "headline": "Senior EU official says Gaza crisis 'looks very much' like genocide",
    "date": "2025-08-07T21:46:22.000+0800",
    "body": "A senior member of the European Union's executive said the displacement and killing in Gaza looked very much like genocide, the first commissioner to level that accusation and publicly break with the body's position on the conflict.\n\n\"If it is not genocide, it looks very much like the definition used to express its meaning,\" Teresa Ribera – the European Commission's second-highest ranking official – told Politico in an interview published on Thursday.\n\nIsrael has repeatedly rejected accusations of carrying out genocide in its war in Gaza. Israel's mission to the EU did not immediately respond to a request for comment.\n\nRibera is the European Commission's Executive Vice President, second only in seniority to President Ursula von der Leyen. The Spanish socialist, whose portfolio includes climate and anti-trust issues, is not responsible for EU foreign policy.\n\n\"What we are seeing is a concrete population being targeted, killed and condemned to starve to death,\" Ribera told Politico.\n\nHer statements went further than the European Commission, which has accused Israel of violating human rights in Gaza, but stopped short of accusing it of genocide.\n\nThe Commission last week proposed curbing Israeli access to its flagship research funding programme after calls from EU countries to increase pressure on Israel to alleviate the humanitarian crisis in the enclave.\n\nIn that proposal, the Commission said Israel had violated a human rights clause in an agreement that governs its relations with the EU.\n\n\"With its intervention in the Gaza Strip and the ensuing humanitarian catastrophe, including thousands of civilian deaths and rapidly rising numbers of spreading extreme malnutrition, specifically of children, Israel is violating human rights and humanitarian law,\" it wrote.\n\nIsrael has fended off accusations of genocide, including a case brought by South Africa at the International Court of Justice in the Hague that Prime Minister Benjamin Netanyahu condemned as \"outrageous\".\n\nThe war was triggered when Hamas-led militants attacked Israeli communities and military bases near Gaza on October 7, 2023. About 1,200 people, including more than 700 civilians, were killed, and 251 hostages were taken to Gaza.\n\nIsrael's military response has devastated the tiny, crowded enclave, killing more than 61,000 people, mostly civilians, according to Palestinian health authorities. Israel has repeatedly said its actions in Gaza are justified as self-defence and accuses Hamas of using civilians as human shields, a charge the militant group denies.\n\nReuters",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/db0172f928516e7e632dee6681ef5d05/2025-08/k_2.jpg",
    "sponsored": false,
    "id": "501f9cc91f98d424"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308529/France-seeks-to-stabilize-wildfire-raging-in-south",
    "headline": "France seeks to 'stabilize' wildfire raging in south",
    "date": "2025-08-07T23:30:18.000+0800",
    "body": "With Europe facing new August heatwaves as concerns grow over the impact of global warming, many areas are on alert for wildfires.\n\nRegional authorities in Spain said late Wednesday that a wildfire near the Mediterranean tourist town of Tarifa that prompted evacuations had been stabilised.\n\nAround 2,000 firefighters were still mobilised Thursday in France's southern Aude department to contain the blaze that started Tuesday. Thirteen people have been injured, two of them seriously.\n\n\"The objective is to stabilise the fire\" and halt its progress by the end of the day, said Christophe Magny, chief of the Aude department's firefighter unit.\n\n\"This is a decisive day for the turnaround,\" said Captain Jean-Marie Aversinq, spokesman for France's national SDIS fire services. \"The next step will be the flooding and treatment\" of the vast area affected.\n\nThe fire advanced much more slowly overnight to Thursday than at the start, when it engulfed around 1,000 hectares (2,500 acres) per hour, according to the authorities in the nearby city of Narbonne.\n\nWeather conditions had become more favourable after two days of strong and changing winds that made the blaze's progress difficult to predict.\n\nFirefighters warned that stronger winds were forecast for later Thursday, when local temperatures were set to reach 32 degrees Celsius (90 Fahrenheit).\n\n\"We have to remain cautious,\" Magny said.\n\nA 65-year-old woman, who had refused to evacuate, was found dead in her scorched house, while 13 people were injured, 11 of them firefighters.\n\nThe wildfire is a \"catastrophe on an unprecedented scale\", Prime Minister Francois Bayrou said Wednesday during a visit to the affected region.\n\n\"What is happening today is linked to global warming and linked to drought,\" Bayrou said.\n\nThe blaze has burned around 17,000 hectares of land.\n\nAround 3,000 homes were still threatened by the fire Thursday, firefighters said, while around 1,000 people who had been evacuated in the area were not yet cleared to return home.\n\nIn Saint-Laurent-de-la-Cabrerisse, the village hardest hit by the fire, thick smoke rose Thursday from the pine hills overlooking the vineyards where dry grass was ablaze, an AFP journalist said.\n\nOn the ground, a fire truck and several fire engines were circulating near the flames, with a water-bombing helicopter approaching the blaze.\n\nThe French wildfire is the country's biggest so far in a summer that has already seen around 9,000 fires, mainly along the Mediterranean coast, according to the emergency management service.\n\nAn investigation has been opened into the cause, local officials said, but there were no firm leads so far.\n\nThe Aude department in particular has seen an increase in areas burned in recent years, aggravated by low rainfall and the uprooting of vineyards, which used to help slow down the advance of fires.\n\nThe frequency of wildfires is taking a toll on local residents, said Aude Damesin, who lives in the town of Fabrezan.\n\n\"It's terrible for the wildlife, the flora, and for the people who are losing everything,\" she said.\n\nIn Spain's Tarifa, fire crews secured areas near hotels and other tourist accommodations after getting the blaze under control, local officials said.\n\nAntonio Sanz, interior minister for Andalusia's regional government, said on X that \"the return of all evacuated people\" had been authorised after the fire was \"stabilised\".\n\nSpanish public broadcaster TVE reported that the fire started in a camper van at a beachside campsite, before being quickly spread by strong winds.\n\nAbout 1,550 people and 5,500 vehicles were evacuated from campsites, hotels and homes, Sanz said earlier.\n\nEmergency crews had worked through the night to prevent the fire from reaching coastal resorts.\n\nSpain is experiencing a heatwave with temperatures nearing 40C in many regions, and officials reported 1,060 excess deaths in July that could be attributed to intense heat.\n\nClimate experts say that global warming is driving longer, more intense and more frequent heatwaves around the world, making for more favourable forest fire conditions.\n\n\"The Climate Crisis is at our doorstep. If action is not taken promptly and collectively, it's a matter of 'when' not 'if' the next catastrophe takes place,\" said World Health Organisation chief Tedros Adhanom Ghebreyesus on X, saying his thoughts were with everyone affected by the French fires.\n\n(AFP)",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/6d33e51a70a92f91e1915cd76991bfac/2025-08/AFP__20250807__68ZJ7G6__v1__HighRes__FranceFireEnvironment.jpg",
    "sponsored": false,
    "id": "a5089cd2c9646820"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308490/Trump-Putin-meeting-agreed-for-coming-days-venue-set-Kremlin",
    "headline": "Trump-Putin meeting agreed for 'coming days', venue set: Kremlin",
    "date": "2025-08-07T20:25:42.000+0800",
    "body": "The Kremlin said Thursday that a summit between Presidents Donald Trump and Vladimir Putin was set for the \"coming days\", with the two sides already having agreed the venue \"in principle.\"\n\nThe summit would be the first between sitting US and Russian presidents since Joe Biden met Putin in Geneva in June 2021, and comes as Trump seeks to broker an end to Russia's military assault on Ukraine.\n\nThree rounds of direct talks between Moscow and Kyiv have failed to yield any progress towards a ceasefire, with the two sides appearing far apart in their demands to end the more than three-year-long conflict.\n\nTrump said Wednesday he was likely to meet Putin face-to-face \"very soon.\"\n\n\"At the suggestion of the American side, an agreement has been reached in principle to hold a bilateral summit in the coming days,\" Kremlin aide Yuri Ushakov was quoted as saying on Thursday by Russian state news agencies.\n\n\"We are now starting to work out the details together with our American colleagues,\" Ushakov said.\n\nThe Kremlin said a venue had been agreed \"in principle\", but did not indicate where the summit could take place.\n\n\"Next week has been set as a target date,\" Ushakov added.\n\nTens of thousands have been killed since Russia launched its military offensive on Ukraine in February 2022.\n\nRussian bombardments have forced millions for flee their homes and destroyed swathes of eastern and southern Ukraine.\n\nPutin has resisted multiple calls from the United States, Europe and Kyiv for a ceasefire.\n\nAt talks in Istanbul, Russian negotiators have outlined hardline territorial demands if Ukraine wants Russia to halt its advance -- calling for Kyiv to withdraw from territory it still controls and renounce Western military support.\n\nMoscow has also repeatedly sought to cast doubt on Zelensky's legitimacy and ruled out a meeting between the two leaders until after the terms of a peace deal have been agreed.\n\nThe announcement of the upcoming summit comes a day after US envoy Steve Witkoff met Putin in Moscow.\n\nWitkoff proposed a trilateral meeting with Ukrainian President Volodymyr Zelensky, but Russia did not respond to that proposal, Ushakov said.\n\n\"The Russian side left this option completely without comment,\" he added.\n\nZelensky earlier Thursday had refreshed his call for a meeting with Putin -- which he says is the only way to make progress towards peace.\n\n\"We in Ukraine have repeatedly said that finding real solutions can be truly effective at the level of leaders,\" Zelensky wrote on social media.\n\n\"It is necessary to determine the timing for such a format and the range of issues to be addressed,\" he added.\n\nThe Ukrainian leader said Thursday morning that he had planned to hold \"several\" conversations throughout the course of the day including with German Chancellor Friedrich Merz, as well as French and Italian officials.\n\n\"There will also be communication at the level of national security advisors,\" Zelensky added.\n\n\"The main thing is for Russia, which started this war, to take real steps to end its aggression,\" Zelensky added.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/74868007e2c513f95e3aabbe4fed03a7/2025-08/l_2.jpg",
    "sponsored": false,
    "id": "5e9712c12bf5e8d0"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308459/South-Korea-special-prosecutor-seeks-detention-warrant-for-ex-first-lady",
    "headline": "South Korea special prosecutor seeks detention warrant for ex-first lady",
    "date": "2025-08-07T18:17:47.000+0800",
    "body": "South Korean investigators requested a warrant on Thursday to arrest former first lady Kim Keon Hee on corruption charges, raising the possibility she could join ex-President Yoon Suk Yeol in detention as an investigation against them gathers pace.\n\nThe couple are being probed by two separate special prosecutors appointed after the former leader was ousted over his brief declaration of martial law that triggered six months of political crisis and social upheaval.\n\nKim appeared for questioning on Wednesday at the office of the special prosecutor on charges that include stock fraud, bribery and illegal influence peddling. She apologised for causing concern but did not answer questions from reporters about the allegations.\n\nOh Jeong-hee, a prosecutor acting as spokesperson for the special prosecutor's team, mentioned three criminal statutes listed on the court warrant request that cover the allegations against Kim but did not give details of the charges.\n\nKim's lawyers have denied the allegations against her.\n\nA fine art expert who founded and ran a curation agency, the 52-year-old has been the subject of a number of scandals that at times overshadowed her husband's turbulent presidency which ended two years short of a single five-year term.\n\nYoon, 64, was a career prosecutor who rose to the head of the service before entering politics. He was impeached and removed from office in April and has been on trial on a charge of insurrection and is still under a special prosecutor probe that has widened the scope of the investigation.\n\nOn Thursday, a team of investigators and law enforcement officers armed with a court warrant tried but failed once again to remove Yoon from his prison cell for questioning related to the charges against his wife.\n\n\"Based on the opinion from the site that there was a concern for injury because of the zealous refusal by former President Yoon, the execution of the warrant was called off,\" Oh, the special prosecutor's spokesperson, told a briefing.\n\nYoon's lawyers described a violent scene as officials tried to move him by force from his cell to a correction service vehicle, describing the attempt as \"abusing\" a suspect who was exercising his legal right to refuse interrogation.\n\n\"(Yoon) pleaded that his arms would fall off and please let him go,\" one of his lawyers, Song Jin-ho, told reporters. For over an hour, more than 10 \"burly young people\" wrestled with the former leader and, when they lifted the chair he was sitting in, he was dropped and hit the floor.\n\nYoon was receiving medical attention at the detention centre, Song said.\n\nOh was quoted by the Yonhap News Agency as saying the officials were executing their duties based on a legal warrant issued by a court and that \"minimum force\" was used.\n\nThe incident was the latest occasion when Yoon has defied authorities during the political turmoil. In January, when he had been impeached but was still president, he ordered presidential security service personnel to block police from arresting him.\n\nSince he was jailed, he has refused to attend his trial on insurrection charges and said through his lawyers he was the victim of a political witch hunt.\n\nIf convicted, he faces up to life imprisonment or even the death penalty for the failed martial law attempt.\n\nReuters",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/306f57a78bc847ff0eb5b35ac5db4e46/2025-08/r_1.jpg",
    "sponsored": false,
    "id": "38da49ddb115e6a7"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308486/Electric-air-taxis-could-debut-in-Japan-from-2027",
    "headline": "Electric 'air taxis' could debut in Japan from 2027",
    "date": "2025-08-07T19:19:16.000+0800",
    "body": "Airline ANA said Thursday that, together with a US start-up, it hopes to have electric \"air taxis\" whizzing over Japan from as early as 2027.\n\nANA and California-based Joby Aviation said they will establish a joint venture with a view to deploying more than 100 of the five-seater aircraft.\n\nFlying taxies will \"revolutionise our air mobility\", Koji Shibata, president and CEO of ANA, said in a statement Tuesday.\n\nAn ANA spokesman told AFP on Thursday that the aircraft, designed to carry a pilot and up to four passengers at speeds of up to 200 mph (320km/h), could be in service from as early as 2027.\n\nThe project primarily envisages trips between Narita and Haneda airports and Tokyo, although the routes can diversify in the future.\n\nCurrently, a car or train ride between central Tokyo and Narita typically takes an hour or longer, but Joby's five-seater can shorten this to around 15 minutes, ANA said.\n\nThere are no price details yet, but ANA wants to make the service as affordable as possible for the general public, a spokesman told AFP.\n\nANA and Joby will make a public flight demonstration of the vehicles at the Osaka Expo in October.\n\n\"Where ancient wisdom, legendary craftsmanship and soaring ambition converge -- that's Japan\", said JoeBen Bevirt, founder and CEO of Joby Aviation.\n\n\"And that makes it an extraordinary launchpad for redefining the future of air mobility\".\n\nJoby's aircraft lift off like a helicopter, then transition to fly forward like a plane \"with minimal acoustic impact and zero operating emissions\", according to the firm.\n\nIn December, flying taxi startup Volocopter said it was filing for insolvency, days after another German company in the field, Lilium, was saved from collapse.\n\nVolocopter had been aiming to enter the market in 2025 with its two-seater \"Volocity\" electric air taxi model.\n\nIt suffered a setback when it had to cancel test flights in Paris during this summer's Olympics at short notice after the certification for its aircraft engine didn't come through in time.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/973a85398f0531accdcc34c7681f24df/2025-08/m_1.jpg",
    "sponsored": false,
    "id": "d1f34f02c5eab09f"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308485/Israeli-security-cabinet-to-hold-talks-over-future-Gaza-war-plans",
    "headline": "Israeli security cabinet to hold talks over future Gaza war plans",
    "date": "2025-08-07T18:15:37.000+0800",
    "body": "Israel's security cabinet was expected to meet later Thursday to discuss future military plans in Gaza, according to Israeli media reports, amid speculation of a full takeover of the besieged Palestinian territory.\n\nThe planned meeting comes as international outrage over the dire humanitarian situation in Gaza has ratcheted up pressure on Israel, with UN agencies warning of famine in the devastated territory.\n\nThe Times of Israel said the meeting was set to commence around 6:00 pm local time (1500 GMT).\n\nThe Israeli press, citing officials speaking on condition of anonymity, has predicted Prime Minister Benjamin Netanyahu is hoping to seek approval on expanding operations.\n\nThat would include the pockets of densely populated areas where hostages are believed to be held, such as Gaza City.\n\nOn Wednesday, the military announced a fresh evacuation call for portions of Gaza City in the north, and Khan Yunis in the south, where a spokesman said ground forces were set to \"expand the scope of combat operations\".\n\nAhead of Thursday's meeting, rumours have been rife about disagreements between the cabinet and Israel's military chief Lieutenant General Eyal Zamir.\n\nDefence Minister Israel Katz also weighed in on the matter, saying on social media that Israel's military will have to execute any government decisions on Gaza, following reports that Zamir was against moves to fully occupy Gaza.\n\nKatz said in post on X that while \"it is the right and duty of the chief of staff to express his position in the appropriate forums\", the military must respect policies made by the government.\n\nThe Israeli government is under mounting pressure to end the war, with growing concern over the humanitarian crisis in Gaza and increasing alarm among Israelis about the fate of the remaining hostages.\n\nOut of 251 hostages captured during Hamas's 2023 attack, 49 are still being held in Gaza, including 27 the Israeli military says are dead.\n\nIn Tel Aviv on Wednesday night, hundreds took to the streets calling on the government to secure the release of the remaining captives.\n\nGlobal criticism has soared in recent weeks over the continued suffering of the more than two million Palestinian inhabitants in Gaza, after the United Nations warned that famine was unfolding in the territory.\n\nOn Thursday, displaced Gaza resident Mahmoud Wafi said that the prices of available food remained high and erratic.\n\n\"We hope that food will be made available again in normal quantities and at reasonable prices, because we can no longer afford these extremely high and unrealistic costs,\" the 38-year-old told AFP from Al-Mawasi near Khan Yunis.\n\nGaza's civil defence spokesman Mahmud Bassal said that at least 16 people had been killed in Gaza on Thursday following airstrikes in multiple areas, with dozens more injured.\n\nIn late July, Israel partially eased restrictions on aid entering Gaza, but the UN says the amount allowed into the territory remains insufficient.\n\nAmjad Al-Shawa, head of the Palestinian NGO Network in the Gaza Strip, told AFP that long and slow inspection procedure at entry points into Gaza meant few trucks could enter.\n\n\"What is currently entering the Gaza Strip are very limited numbers of trucks -- between 70 to 80 per day -- carrying only specific types of goods,\" he said.\n\nHe added that over the past few days, \"around 50 to 60 trucks\" destined for the private sector were able to enter for the first time in months.\n\nThe UN estimates that Gaza needs at least 600 trucks of aid per day to meet its residents' basic needs.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/366849f10fffcb9525d32be6be982197/2025-08/n_2.jpg",
    "sponsored": false,
    "id": "3209db6f23ab2c30"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308475/Thai-prosecutors-indict-23-over-quake-skyscraper-collapse",
    "headline": "Thai prosecutors indict 23 over quake skyscraper collapse",
    "date": "2025-08-07T17:35:23.000+0800",
    "body": "Thai prosecutors indicted 23 people and firms on Thursday, in a case linked to the deadly collapse of a Bangkok high-rise in an earthquake.\n\nThe 30-storey tower crumbled seconds after a 7.7-magnitude earthquake hit Myanmar on March 28, killing thousands in Thailand's wartorn neighbour.\n\nThe tower, meant to house the state audit office, was the only building in Bangkok to collapse, killing 89 people on the site, mostly construction workers. The speed and suddenness with which it fell prompted a legal probe.\n\nThailand's Office of the Attorney General said a case has been submitted to a criminal court, with a decision expected in a matter of months.\n\n\"Investigators agreed to indict 23 individuals and legal entities over professional misconduct and forged documents,\" it said in a statement.\n\nThe indictment included 16 individuals and seven firms, and also listed the names of people representing some of the accused companies, which include an architectural firm and a Chinese construction business.\n\nFurther details of the allegations were not released.\n\nHowever, separately, justice department investigators have previously said they were probing the quality of construction materials used at the site.\n\nAmong the individuals indicted is Premchai Karnasuta, one of Thailand's top tycoons.\n\nHe serves as executive director of the Italian-Thai Development (ITD) company -- one of the kingdom's biggest construction businesses, which has also been indicted.\n\nIf convicted, 71-year-old Premchai faces up to 10 years in prison and a fine of 200,000 baht ($6,000).\n\nThis is not the tycoon's first legal tangle.\n\nIn 2021, a Thai court sentenced him to three years and two months in prison for poaching protected wildlife, including a black panther.\n\nHe was released early in 2023 as part of a group of inmates granted clemency for good behaviour.\n\nAccording to public filings with the Stock Exchange of Thailand, Premchai owns nearly 12 percent of ITD's shares.\n\nHe was taken into pre-trial detention in May.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/da9e4145f1466d0d6f45b709a2807df3/2025-08/p_1.jpg",
    "sponsored": false,
    "id": "d3b88adeb13688eb"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308454/Victims-feeling-exhausted-and-anxious-about-wrangling-over-Epstein-files",
    "headline": "Victims feeling exhausted and anxious about wrangling over Epstein files",
    "date": "2025-08-07T17:50:00.000+0800",
    "body": "Women who say they were abused by Jeffrey Epstein are feeling skeptical and anxious about the Justice Department's handling of records related to the convicted sex offender, with some backing more public disclosures as an overdue measure of transparency, and others expressing concerns about their privacy and the Trump administration's motivations.\n\nIn letters addressed to federal judges in New York this week, several victims or their attorneys said they would support the public release of grand jury testimony that led to criminal indictments against Epstein and his former girlfriend, Ghislaine Maxwell — if the government agreed to allow them to review the material and redact sensitive information.\n\nThe Justice Department has asked the court to take the rare step of unsealing transcripts of that secret testimony, in part to placate people who believe that the government has hidden some things it knows about Epstein's wrongdoing.\n\nOther victims, meanwhile, accused President Donald Trump of sidelining victims as he seeks to shift the focus from Epstein, who killed himself in 2019 while awaiting trial on charges that he habitually sexually abused underage girls. Some expressed concern that the administration — in its eagerness to make the scandal go away — might give Maxwell clemency, immunity from future prosecution or better living conditions in prison as part of a deal to get her to testify before Congress.\n\n“I am not some pawn in your political warfare,” one alleged victim wrote in a letter submitted to the court by her lawyer this week. “What you have done and continue to do is eating at me day after day as you help to perpetuate this story indefinitely.”\n\nAdded another victim, in a letter submitted anonymously on Wednesday: “This is all very exhausting.”\n\nMaxwell was convicted in 2021 of helping Epstein sexually abuse underage girls and is serving a 20-year prison sentence. A top Justice Department official, Deputy Attorney General Todd Blanche, interviewed Maxwell for nine hours late last month, saying he wanted to hear anything she had to say about misdeeds committed by Epstein or others. After that interview, Maxwell was moved from a federal prison in Florida to a low-security prison camp in Texas.\n\nAlicia Arden, who said Epstein sexually assaulted her in the late 1990s, held a news conference on Wednesday in Los Angeles. She said she would support the release of additional material related to the case, including a transcript of Maxwell’s interview with Blanche.\n\nBut she also expressed outrage at the possibility that Maxwell could receive clemency or other special treatment through the process, adding that the Justice Department’s approach had been “very upsetting” so far.\n\nThe Trump administration has faced weeks of furor from some segments of the president's political base, which have demanded public disclosure of files related to Epstein. Epstein has long been the subject of conspiracy theories because of his friendships with the rich and powerful, including Trump himself, Britain's Prince Andrew and former President Bill Clinton.\n\nLast month, the Justice Department announced it would not release additional files related to the Epstein sex trafficking investigation.\n\nProsecutors later asked to unseal the grand jury transcripts, though they've told the court they contain little information that hasn't already been made public. Two judges who will decide whether to release the transcripts then asked victims to share their views on the matter.\n\nIn a letter submitted to the court Tuesday, attorneys Brad Edwards and Paul Cassell, who represent numerous Epstein victims, wrote: “For survivors who bravely testified, the perception that Ms. Maxwell is being legitimized in public discourse has already resulted in re-traumatization.”\n\nAn attorney for Maxwell, David Oscar Markus, said this week that she opposed the release of the grand jury transcripts.\n\n“Jeffrey Epstein is dead. Ghislaine Maxwell is not,” he wrote. “Whatever interest the public may have in Epstein, that interest cannot justify a broad intrusion into grand jury secrecy in a case where the defendant is alive, her legal options are viable, and her due process rights remain.”\n\nThe Justice Department did not respond to a request for comment on the victims' statements.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/02b20acbfc8d9d11325cc07d84943ca2/2025-08/t_1.jpg",
    "sponsored": false,
    "id": "fe818632114a714e"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308456/North-Korean-rescued-after-swimming-across-border-Seoul",
    "headline": "North Korean rescued after swimming across border: Seoul",
    "date": "2025-08-07T16:57:37.000+0800",
    "body": "A North Korean defector who swam across a sea border with South Korea while reportedly tied to floating plastic has been rescued and taken into custody, Seoul authorities said Thursday.\n\nThe North Korean managed to swim across the de facto maritime border off the western coast of the Korean peninsula on the night of July 30, South Korea's Joint Chiefs of Staff said.\n\nThe border is known as the Northern Limit Line and has occasionally served as a route for North Korean defectors swimming to South Korea's Ganghwa Island.\n\n\"The military identified the individual near the north of the mid-river boundary,\" a military official told reporters.\n\nThe individual, who local media reported was tied to Styrofoam when he was found, waved for help and said he wanted to defect to South Korea when asked by a South Korean naval officer, the official said.\n\nThe operation took about 10 hours, according to Seoul, and the individual was rescued at around 4:00 am on July 31 (1900 GMT July 30).\n\nThe North Korean is now in custody and has expressed their wish to defect, the defence ministry said.\n\nGanghwa Island, located northwest of Seoul, is one of the closest South Korean territories to North Korea, with some parts of the surrounding sea lying just 10 kilometres (six miles) from the maritime border between the two countries.\n\nTens of thousands of North Koreans have fled to the South since the peninsula was divided by war in the 1950s, with most going overland to neighbouring China first, then entering a third country such as Thailand before finally making it to the South.\n\nDefections across the land border that divides the peninsula are relatively rare, as the area is densely forested, heavily mined and monitored by soldiers on both sides.\n\nBut a North Korean man defected last month to the South by crossing the Military Demarcation Line.\n\nThe number of successful escapes dropped significantly from 2020 after the North sealed its borders -- purportedly with shoot-on-sight orders along the frontier with China -- to prevent the spread of Covid-19.\n\nNorth Koreans are typically handed over to Seoul's intelligence agency for screening when they arrive in the South.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/bb523b7de117f8ee8fba96f74cb04bdd/2025-08/s_1.jpg",
    "sponsored": false,
    "id": "9c884f7367a277e0"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308453/Hiroshima-survivors-fear-rising-nuclear-threat-on-the-80th-anniversary-of-atomic-bombing",
    "headline": "Hiroshima survivors fear rising nuclear threat on the 80th anniversary of atomic bombing",
    "date": "2025-08-07T15:43:29.000+0800",
    "body": "Hiroshima on Wednesday marked the 80th anniversary of the U.S. atomic bombing of the western Japanese city, with many aging survivors expressing frustration about the growing support of global leaders for nuclear weapons as a deterrence.\n\nWith the number of survivors rapidly declining and their average age now exceeding 86, the anniversary is considered the last milestone event for many of them.\n\n“There will be nobody left to pass on this sad and painful experience in 10 years or 20 years,” Minoru Suzuto, a 94-year-old survivor, said after he kneeled down to pray at the cenotaph. “That’s why I want to share (my story) as much as I can.”\n\nThe bombing of Hiroshima on Aug. 6, 1945, destroyed the city and killed 140,000 people. A second bomb dropped three days later on Nagasaki killed 70,000. Japan surrendered on Aug. 15, ending World War II and Japan’s nearly half-century of aggression in Asia.\n\nHiroshima Mayor Kazumi Matsui warned against a growing acceptance of military buildups and of using nuclear weapons for national security during Russia's war in Ukraine and conflicts in the Mideast, with the United States and Russia possessing most of the world's nuclear warheads.\n\n“These developments flagrantly disregard the lessons the international community should have learned from the tragedies of history,” he said. \"They threaten to topple the peacebuilding frameworks so many have worked so hard to construct.”\n\nHe urged younger generations to recognize that such “misguided policies\" could cause “utterly inhumane\" consequences for their future.\n\n“We don't have much time left, while we face a greater nuclear threat than ever,” said Nihon Hidankyo, a Japanese grassroots organization of survivors that won the Nobel Peace Prize last year for its pursuit of nuclear abolishment.\n\n“Our biggest challenge now is to change, even just a little, nuclear weapons states that give us the cold shoulder,” the organization said in its statement.\n\nAbout 55,000 people, including representatives from a record 120 countries and regions attended the ceremony. A minute of silence was held while a peace bell rang out at 8:15 a.m., the time when a U.S. B-29 dropped the bomb on the city.\n\nJapanese Prime Minister Shigeru Ishiba, the city’s mayor and other officials laid flowers at the cenotaph. Dozens of white doves, a symbol of peace, were released after the mayor’s speech.\n\nHours before the official ceremony, as the sun rose over Hiroshima, survivors and their families started paying tribute to the victims at the Peace Memorial Park, near the hypocenter of the nuclear blast 80 years ago.\n\nKazuo Miyoshi, a 74-year-old retiree, came to honor his grandfather and two cousins who died in the bombing and prayed that the “mistake” will never be repeated.\n\n“We do not need nuclear weapons,” Miyoshi said.\n\n“There is hope,” U.N. Secretary General Antonio Guterres said in a statement read by Izumi Nakamitsu, U.N. Under-Secretary-General and High Representative for Disarmament Affairs, noting Nihon Hidankyo's Nobel Peace Prize and countries' re-commitment to a nuclear free world in “the Pact for the Future” adopted last year.\n\nGuterres stressed the importance to carry forward the survivors' testimony and message of peace and added: “Remembering the past is about protecting and building peace today and in the future.\"\n\nNear Hiroshima's iconic Atomic Bomb Dome under high security, more than 200 protesters gathered, holding posters and flags carrying messages such as “No Nuke, Stop War” and “Free Gaza! No more genocide” while chanting slogans. Local police said two people were arrested in separate cases, each on suspicion of assaulting a security guard.\n\nWednesday's anniversary comes at a time when possession of nuclear weapons for deterrence is increasingly supported by the international community, including Japan.\n\nSome survivors said they were disappointed by President Donald Trump's recent remark justifying Washington's attack on Iran in June by comparing it to the atomic bombing of Hiroshima and Nagasaki, and the mild response from the Japanese government.\n\n“It’s ridiculous,” said Kosei Mito, a 79-year-old former high school teacher who was exposed to radiation while he was still in his mother’s womb. “I don’t think we can get rid of nuclear weapons as long as it was justified by the assailant.”\n\nIn the Vatican, Pope Leo XIV said Wednesday that he was praying for those who suffered physical, psychological and social effects from the atomic bomb on Hiroshima, adding that the event remains “a universal warning against the devastation caused by wars and, in particular, by nuclear weapons.”\n\nJapan's government has rejected the survivors' request to sign the Treaty on the Prohibition of Nuclear Weapons or attend its meetings as observers because it is under the protection of the U.S. nuclear umbrella.\n\nMatsui, the city's mayor, in his speech Wednesday, urged Japan's government to sign and ratify the nuclear weapons ban treaty, a request also made by several groups of survivors in their meeting with Ishiba after the ceremony.\n\nIshiba, in a speech, reiterated his government’s pledge to work toward a world without nuclear weapons, but did not mention the treaty and again indicated his government’s support for nuclear weapons possession for deterrence.\n\nAt a news conference later Wednesday, Ishiba justified Japan's reliance on U.S. nuclear deterrence, saying Japan, which follows a non-nuclear principle, is surrounded by neighbors that possess nuclear weapons. The stance, he said, does not contradict Japan's pursuit of a nuclear-free world.\n\nPast prime ministers have stressed Japan’s status as the world’s only country to have suffered nuclear attacks and have said Japan is determined to pursue peace, but survivors say it’s a hollow promise.\n\nThe Japanese government has only paid compensation to war veterans and their families, even though survivors have sought redress for civilian victims. They have also sought acknowledgment by the U.S. government of its responsibility for the civilian deaths.",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/cf4a50bb795146742d32eaf6b1923b4d/2025-08/u.JPG",
    "sponsored": false,
    "id": "415e5db35bdc3525"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308467/Cambodia-and-Thailand-to-hammer-out-permanent-ceasefire-in-Malaysia-meeting",
    "headline": "Cambodia and Thailand to hammer out permanent ceasefire in Malaysia meeting",
    "date": "2025-08-07T16:30:07.000+0800",
    "body": "Cambodia and Thailand's top defence officials began a meeting in Malaysia on Thursday to finalise a permanent end to hostilities following a violent five-day border conflict that ended in an unconditional ceasefire late in July.\n\nThe Southeast Asian neighbours saw the worst fighting in over a decade last month, including exchanges of artillery fire and jet fighter bombing runs that claimed at least 43 lives and left over 300,000 people displaced on both sides of the border.\n\nFighting continued despite diplomatic interventions from China and Malaysia, chair of the regional bloc ASEAN, calling for restraint.\n\nThe leaders of Cambodia and Thailand only came to the negotiation table when U.S. President Donald Trump told them that tariff negotiations would not continue unless there was peace, Reuters exclusively reported.\n\nCambodian Defence Minister Tea Seiha and Thailand's acting defence minister Nattaphon Narkphanit are due to meet at Malaysia's Armed Forces headquarters in Kuala Lumpur.\n\nThe two countries will establish guidelines to resolve border disputes, restore trust between their military forces and agree to a ceasefire with measures to minimise tensions and protect civilians, Nattaphon said in a statement before the talks.\n\nThe conditions were formulated during three days of talks between senior officials in Kuala Lumpur and are to be finalised on the fourth day in the presence of observers from China and the United States.\n\nThailand and Cambodia have quarrelled for decades over undemarcated parts of their 817 km (508 miles) land border, which was first mapped by France in 1907 when the latter was its colony.\n\nReuters",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/c2c1492d7012492e9c4e9b35a429833a/2025-08/q_1.jpg",
    "sponsored": false,
    "id": "c46eb92c1cec4344"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308449/Trumps-dividend-promise-for-Americans-leaves-open-questions",
    "headline": "Trump's 'dividend' promise for Americans leaves open questions",
    "date": "2025-08-07T15:11:35.000+0800",
    "body": "If Donald Trump is to be believed, millions of Americans could receive a financial slice of the fortunes generated by the US president's sweeping tariffs.\n\nBut the eyebrow-raising suggestion from a leader with a flair for creating headlines is largely opaque -- with key questions left open about how the giveaway would be funded.\n\nTrump himself has acknowledged the difficulty in splashing cash at a time when the United States faces crushing debt.\n\n\"We have so much money coming in, we are thinking about a little rebate,\" Trump said last month, \"but the big thing we want to do is pay down debt.\"\n\nHe has since referred to the so-called rebate as a \"dividend,\" and said it could be for \"people that would be middle income people and lower income people.\"\n\nHis idea has, naturally, roused interest.\n\nRepublican Senator Josh Hawley introduced a bill in July that would see $600 checks sent to each adult and dependent child in American families.\n\nTrump has a track record in dishing out money -- or at least taking the credit for it.\n\nDuring the Covid pandemic, he insisted that his name be put on government checks distributed to tens of millions of Americans as financial support.\n\nTrump's latest plan raises a key question: How will it be financed?\n\nThe United States faces a national deficit that worsened from October to June compared to the same period a year earlier.\n\nThat was despite a rise in revenue generated by tariffs that Trump has slapped on dozens of US trading partners.\n\nHanding out cash to Americans would add to the deficit and increase the country's debt, which was at more than $36.8 trillion by early August.\n\nTrump, when explaining his dividend idea, has claimed the United States is raking in trillions of dollars from other countries thanks to his protectionist agenda.\n\nThe Republican has also cited large investments promised by Japan and the European Union -- deals that coincided with agreements on US tariffs.\n\nBut foreign leaders paint a different picture.\n\nJapan, for example, has stated that its $550 billion pledge will largely be in the form of loans and guarantees -- certainly not just hard cash.\n\nAnd Trump's claims about the revenue generated by tariffs can also be misleading.\n\nThe president claims -- wrongly -- that tariffs are paid by foreign countries to the US government.\n\nYet, in reality, it is importers in the United States that are on the hook.\n\nMost economists note that American consumers therefore end up paying more as businesses, facing rising costs, raise prices on their products.\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/aa9d1ed8703cbf3a18dafd5c99c0af92/2025-08/y_2.jpg",
    "sponsored": false,
    "id": "3b603260a9828039"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308452/Great-Barrier-Reef-records-largest-annual-coral-loss-in-39-years",
    "headline": "Great Barrier Reef records largest annual coral loss in 39 years",
    "date": "2025-08-07T14:39:50.000+0800",
    "body": "The Great Barrier Reef has experienced its greatest annual loss of live coral across most of its expanse in four decades of record-keeping, Australian authorities say.\n\nBut due to increasing coral cover since 2017, the coral deaths — caused mainly by bleaching last year associated with climate change — have left the area of living coral across the iconic reef system close to its long-term average, the Australian Institute of Marine Science said in its annual survey on Wednesday.\n\nThe change underscores a new level of volatility on the UNESCO World Heritage Site, the report said.\n\nMike Emslie, who heads the tropical marine research agency’s long-term monitoring program, said the live coral cover measured in 2024 was the largest recorded in 39 years of surveys.\n\nThe losses from such a high base of coral cover had partially cushioned the serious climate impacts on the world’s largest reef ecosystem, which covers 344,000 square kilometers (133,000 square miles) off the northeast Australian coast, he said.\n\n“These are substantial impacts and evidence that the increasing frequency of coral bleaching is really starting to have detrimental effects on the Great Barrier Reef,” Emslie said on Thursday.\n\n“While there’s still a lot of coral cover out there, these are record declines that we have seen in any one year of monitoring,” he added.\n\nEmslie’s agency divides the Great Barrier Reef, which extends 1,500 kilometers (900 miles) along the Queensland state coast, into three similarly-sized regions: northern, central and southern.\n\nLiving coral cover shrunk by almost a third in the south in a year, a quarter in the north and by 14% in the central region, the report said.\n\nBecause of record global heat in 2023 and 2024, the world is still going through its biggest — and fourth ever recorded — mass coral bleaching event on record, with heat stress hurting nearly 84% of the world’s coral reef area, including the Great Barrier Reef, according to the U.S. National Oceanic and Atmospheric Administration’s coral reef watch. So far at least 83 countries have been impacted.\n\nThis bleaching event started in January 2023 and was declared a global crisis in April 2024. It easily eclipsed the previous biggest global coral bleaching event, from 2014 to 2017, when 68.2% had bleaching from heat stress.\n\nLarge areas around Australia — but not the Great Barrier Reef — hit the maximum or near maximum of bleaching alert status during this latest event. Australia in March this year started aerial surveys of 281 reefs across the Torres Strait and the entire northern Great Barrier Reef and found widespread coral bleaching. Of the 281 reefs, 78 were more than 30% bleached.\n\nCoral has a hard time thriving and at times even surviving in prolonged hot water. They can survive short bursts, but once certain thresholds of weeks and high temperatures are passed, the coral is bleached, which means it turns white because it expels the algae that live in the tissue and give them their colors. Bleached corals are not dead, but they are weaker and more vulnerable to disease.\n\nCoral reefs often bounce back from these mass global bleaching events, but often they are not as strong as they were before.\n\nCoral reefs are considered a “unique and threatened system” due to climate change and are especially vulnerable to global warming beyond 1.5 degrees Celsius (2.7 degrees Fahrenheit) since pre-industrial times, the United Nations Intergovernmental Panel on Climate Change proclaimed in 2018. The world has now warmed 1.3 degrees Celsius since pre-industrial times. That report said “tropical corals may be even more vulnerable to climate change than indicated in assessments made in 2014.”\n\nThe report said back-to-back big bleaching events at the Great Barrier Reef in the mid 2010s “suggest that the research community may have underestimated climate risks for coral reefs.”\n\n“Warm water (tropical) coral reefs are projected to reach a very high risk of impact at 1.2°C, with most available evidence suggesting that coral-dominated ecosystems will be non-existent at this temperature or higher. At this point, coral abundance will be near zero at many locations,” the report said.\n\nUpdated 3.39pm",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/b3ad1f69757316dc1c5a9d74d164a80e/2025-08/v_1.jpg",
    "sponsored": false,
    "id": "345c54686d9001e9"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308447/Dangerous-dreams-Inside-internets-sleepmaxxing-craze",
    "headline": "Dangerous dreams: Inside internet's 'sleepmaxxing' craze",
    "date": "2025-08-07T14:07:27.000+0800",
    "body": "From mouth taping to rope-assisted neck swinging, a viral social media trend is promoting extreme bedtime routines that claim to deliver perfect sleep -- despite scant medical evidence and potential safety risks.\n\nInfluencers on platforms including TikTok and X are fueling a growing wellness obsession popularly known as \"sleepmaxxing,\" a catch-all term for activities and products aimed at optimizing sleep quality.\n\nThe explosive rise of the trend -- generating tens of millions of posts -- underscores social media's power to legitimize unproven health practices, particularly as tech platforms scale back content moderation.\n\nOne so-called insomnia cure involves people hanging by their necks with ropes or belts and swinging their bodies in the air.\n\n\"Those who try it claim their sleep problems have significantly improved,\" said one clip on X that racked up more than 11 million views.\n\nExperts have raised alarm about the trick, following a Chinese state broadcaster's report that attributed at least one fatality in China last year to a similar \"neck hanging\" routine.\n\nSuch sleepmaxxing techniques are \"ridiculous, potentially harmful, and evidence-free,\" Timothy Caulfield, a misinformation expert from the University of Alberta in Canada, told AFP.\n\n\"It is a good example of how social media can normalize the absurd.\"\n\nAnother popular practice is taping of the mouth for sleep, promoted as a way to encourage nasal breathing. Influencers claim it offers broad benefits, from better sleep and improved oral health to reduced snoring.\n\nBut a report from George Washington University found that most of these claims were not supported by medical research.\n\nExperts have also warned the practice could be dangerous, particularly for those suffering from sleep apnea, a condition that disrupts breathing during sleep.\n\nOther unfounded tricks touted by sleepmaxxing influencers include wearing blue- or red-tinted glasses, using weighted blankets, and eating two kiwis just before bed.\n\n\"My concern with the 'sleepmaxxing' trend -- particularly as it's presented on platforms like TikTok -- is that much of the advice being shared can be actively unhelpful, even damaging, for people struggling with real sleep issues,\" Kathryn Pinkham, a Britain-based insomnia specialist, told AFP.\n\n\"While some of these tips might be harmless for people who generally sleep well, they can increase pressure and anxiety for those dealing with chronic insomnia or other persistent sleep problems.\"\n\nWhile sound and sufficient sleep is considered a cornerstone of good health, experts warn that the trend may be contributing to orthosomnia, an obsessive preoccupation with achieving perfect sleep.\n\n\"The pressure to get perfect sleep is embedded in the sleepmaxxing culture,\" said Eric Zhou of Harvard Medical School.\n\n\"While prioritizing restful sleep is commendable, setting perfection as your goal is problematic. Even good sleepers vary from night to night.\"\n\nPinkham added that poor sleep was often fuelled by the \"anxiety to fix it,\" a fact largely unacknowledged by sleepmaxxing influencers.\n\n\"The more we try to control sleep with hacks or rigid routines, the more vigilant and stressed we become -- paradoxically making sleep harder,\" Pinkham said.\n\nMany sleepmaxxing posts focus on enhancing physical appearance rather than improving health, reflecting an overlap with \"looksmaxxing\" -- another online trend that encourages unproven and sometimes dangerous techniques to boost sexual appeal.\n\nSome sleepmaxxing influencers have sought to profit from the trend's growing popularity, promoting products such as mouth tapes, sleep-enhancing drink powders, and \"sleepmax gummies\" containing melatonin.\n\nThat may be in violation of legal norms in some countries like Britain, where melatonin is available only as a prescription drug.\n\nThe American Academy of Sleep Medicine has recommended against using melatonin to treat insomnia in adults, citing inconsistent medical evidence regarding its effectiveness.\n\nSome medical experts also caution about the impact of the placebo effect on insomnia patients using sleep medication -- when people report real improvement after taking a fake or nonexistent treatment because of their beliefs.\n\n\"Many of these tips come from non-experts and aren't grounded in clinical evidence,\" said Pinkham.\n\n\"For people with genuine sleep issues, this kind of advice often adds pressure rather than relief.\"\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/2b447b8f036cd2da3d88ebe6003d71e4/2025-08/z_1.jpg",
    "sponsored": false,
    "id": "6ddfe6171b93580c"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308444/Grok-is-that-Gaza-AI-image-checks-mislocate-news-photographs",
    "headline": "Grok, is that Gaza? AI image checks mislocate news photographs",
    "date": "2025-08-07T13:52:50.000+0800",
    "body": "This image by AFP photojournalist Omar al-Qattaa shows a skeletal, underfed girl in Gaza, where Israel's blockade has fuelled fears of mass famine in the Palestinian territory.\n\nBut when social media users asked Grok where it came from, X boss Elon Musk's artificial intelligence chatbot was certain that the photograph was taken in Yemen nearly seven years ago.\n\nThe AI bot's untrue response was widely shared online and a left-wing pro-Palestinian French lawmaker, Aymeric Caron, was accused of peddling disinformation on the Israel-Hamas war for posting the photo.\n\nAt a time when internet users are turning to AI to verify images more and more, the furore shows the risks of trusting tools like Grok, when the technology is far from error-free.\n\nGrok said the photo showed Amal Hussain, a seven-year-old Yemeni child, in October 2018.\n\nIn fact the photo shows nine-year-old Mariam Dawwas in the arms of her mother Modallala in Gaza City on August 2, 2025.\n\nBefore the war, sparked by Hamas's October 7, 2023 attack on Israel, Mariam weighed 25 kilograms, her mother told AFP.\n\nToday, she weighs only nine. The only nutrition she gets to help her condition is milk, Modallala told AFP -- and even that's \"not always available\".\n\nChallenged on its incorrect response, Grok said: \"I do not spread fake news; I base my answers on verified sources.\"\n\nThe chatbot eventually issued a response that recognised the error -- but in reply to further queries the next day, Grok repeated its claim that the photo was from Yemen.\n\nThe chatbot has previously issued content that praised Nazi leader Adolf Hitler and that suggested people with Jewish surnames were more likely to spread online hate.\n\nGrok's mistakes illustrate the limits of AI tools, whose functions are as impenetrable as \"black boxes\", said Louis de Diesbach, a researcher in technological ethics.\n\n\"We don't know exactly why they give this or that reply, nor how they prioritise their sources,\" said Diesbach, author of a book on AI tools, \"Hello ChatGPT\".\n\nEach AI has biases linked to the information it was trained on and the instructions of its creators, he said.\n\nIn the researcher's view Grok, made by Musk's xAI start-up, shows \"highly pronounced biases which are highly aligned with the ideology\" of the South African billionaire, a former confidante of US President Donald Trump and a standard-bearer for the radical right.\n\nAsking a chatbot to pinpoint a photo's origin takes it out of its proper role, said Diesbach.\n\n\"Typically, when you look for the origin of an image, it might say: 'This photo could have been taken in Yemen, could have been taken in Gaza, could have been taken in pretty much any country where there is famine'.\"\n\nAI does not necessarily seek accuracy -- \"that's not the goal,\" the expert said.\n\nAnother AFP photograph of a starving Gazan child by al-Qattaa, taken in July 2025, had already been wrongly located and dated by Grok to Yemen, 2016.\n\nThat error led to internet users accusing the French newspaper Liberation, which had published the photo, of manipulation.\n\nAn AI's bias is linked to the data it is fed and what happens during fine-tuning -- the so-called alignment phase -- which then determines what the model would rate as a good or bad answer.\n\n\"Just because you explain to it that the answer's wrong doesn't mean it will then give a different one,\" Diesbach said.\n\n\"Its training data has not changed and neither has its alignment.\"\n\nGrok is not alone in wrongly identifying images.\n\nWhen AFP asked Mistral AI's Le Chat -- which is in part trained on AFP's articles under an agreement between the French start-up and the news agency -- the bot also misidentified the photo of Mariam Dawwas as being from Yemen.\n\nFor Diesbach, chatbots must never be used as tools to verify facts.\n\n\"They are not made to tell the truth,\" but to \"generate content, whether true or false\", he said.\n\n\"You have to look at it like a friendly pathological liar -- it may not always lie, but it always could.\"\n\nAFP",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/f0976895811a63c632a6adea67748eb3/2025-08/b_1.jpg",
    "sponsored": false,
    "id": "184933e963e3048d"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308451/Harvard-scientists-say-research-could-be-set-back-years-after-funding-freeze",
    "headline": "Harvard scientists say research could be set back years after funding freeze",
    "date": "2025-08-07T13:36:37.000+0800",
    "body": "Harvard University professor Alberto Ascherio's research is literally frozen.\n\nCollected from millions of U.S. soldiers over two decades using millions of dollars from taxpayers, the epidemiology and nutrition scientist has blood samples stored in liquid nitrogen freezers within the university’s T.H. Chan School of Public Health.\n\nThe samples are key to his award-winning research, which seeks a cure to multiple sclerosis and other neurodegenerative diseases. But for months, Ascherio has been unable to work with the samples because he lost $7 million in federal research funding, a casualty of Harvard's fight with the Trump administration.\n\n“It's like we have been creating a state-of-the-art telescope to explore the universe, and now we don’t have money to launch it,” said Ascherio. “We built everything and now we are ready to use it to make a new discovery that could impact millions of people in the world and then, 'Poof. You're being cut off.'”\n\nThe loss of an estimated $2.6 billion in federal funding at Harvard has meant that some of the world's most prominent researchers are laying off young researchers. They are shelving years or even decades of research, into everything from opioid addiction to cancer.\n\nAnd despite Harvard's lawsuits against the administration, and settlement talks between the warring parties, researchers are confronting the fact that some of their work may never resume.\n\nThe funding cuts are part of a monthslong battle that the Trump administration has waged against some the country's top universities including Columbia, Brown and Northwestern. The administration has taken a particularly aggressive stance against Harvard, freezing funding after the country's oldest university rejected a series of government demands issued by a federal antisemitism task force.\n\nThe government had demanded sweeping changes at Harvard related to campus protests, academics and admissions — meant to address government accusations that the university had become a hotbed of liberalism and tolerated anti-Jewish harassment.\n\nHarvard responded by filing a federal lawsuit, accusing the Trump administration of waging a retaliation campaign against the university. In the lawsuit, it laid out reforms it had taken to address antisemitism but also vowed not to “surrender its independence or relinquish its constitutional rights.”\n\n“Make no mistake: Harvard rejects antisemitism and discrimination in all of its forms and is actively making structural reforms to eradicate antisemitism on campus,\" the university said in its legal complaint. “But rather than engage with Harvard regarding those ongoing efforts, the Government announced a sweeping freeze of funding for medical, scientific, technological, and other research that has nothing at all to do with antisemitism.”\n\nThe Trump administration denies the cuts were made in retaliation, saying the grants were under review even before the demands were sent in April. It argues the government has wide discretion to cancel federal contracts for policy reasons.\n\nThe funding cuts have left Harvard's research community in a state of shock, feeling as if they are being unfairly targeted in a fight has nothing to do with them. Some have been forced to shutter labs or scramble to find non-government funding to replace lost money.\n\nIn May, Harvard announced that it would put up at least $250 million of its own money to continue research efforts, but university President Alan Garber warned of “difficult decisions and sacrifices” ahead.\n\nAscherio said the university was able to pull together funding to pay his researchers’ salaries until next June. But he’s still been left without resources needed to fund critical research tasks, like lab work. Even a year's delay can put his research back five years, he said.\n\n“It’s really devastating,” agreed Rita Hamad, the director of the Social Policies for Health Equity Research Center at Harvard, who had three multiyear grants totaling $10 million canceled by the Trump administration. The grants funded research into the impact of school segregation on heart health, how pandemic-era policies in over 250 counties affected mental health, and the role of neighborhood factors in dementia.\n\nAt the School of Public Health, where Hamad is based, 190 grants have been terminated, affecting roughly 130 scientists.\n\n“Just thinking about all the knowledge that’s not going to be gained or that is going to be actively lost,\" Hamad said. She expects significant layoffs on her team if the funding freeze continues for a few more months. \"It’s all just a mixture of frustration and anger and sadness all the time, every day.\"\n\nJohn Quackenbush, a professor of computational biology and bioinformatics at the School of Public Health, has spent the past few months enduring cuts on multiple fronts.\n\nIn April, a multimillion dollar grant was not renewed, jeopardizing a study into the role sex plays in disease. In May, he lost about $1.2 million in federal funding for in the coming year due to the Harvard freeze. Four departmental grants worth $24 million that funded training of doctoral students also were cancelled as part of the fight with the Trump administration, Quackenbush said.\n\n“I’m in a position where I have to really think about, ‘Can I revive this research?’” he said. “Can I restart these programs even if Harvard and the Trump administration reached some kind of settlement? If they do reach a settlement, how quickly can the funding be turned back on? Can it be turned back on?”\n\nThe researchers all agreed that the funding cuts have little or nothing to do with the university's fight against antisemitism. Some, however, argue changes at Harvard were long overdue and pressure from the Trump administration was necessary.\n\nBertha Madras, a Harvard psychobiologist who lost funding to create a free, parent-focused training to prevent teen opioid overdose and drug use, said she’s happy to see the culling of what she called “politically motivated social science studies.”\n\nMadras said pressure from the White House has catalyzed much-needed  reform at the university, where several programs of study have “really gone off the wall in terms of being shaped by orthodoxy that is not representative of the country as a whole.”\n\nBut Madras, who served on the President’s Commission on Opioids during Trump’s first term, said holding scientists’ research funding hostage as a bargaining chip doesn’t make sense.\n\n“I don’t know if reform would have happened without the president of the United States pointing the bony finger at Harvard,\" she said. “But sacrificing science is problematic, and it’s very worrisome because it is one of the major pillars of strength of the country.”\n\nQuackenbush and other Harvard researchers argue the cuts are part of a larger attack on science by the Trump administration that puts the country's reputation as the global research leader at risk. Support for students and post-doctoral fellows has been slashed, visas for foreign scholars threatened, and new guidelines and funding cuts at the NIH will make it much more difficult to get federal funding in the future, they said. It also will be difficult to replace federal funding with money from the private sector.\n\n“We’re all sort of moving toward this future in which this 80-year partnership between the government and the universities is going to be jeopardized,” Quackenbush said. “We’re going to face real challenges in continuing to lead the world in scientific excellence.”",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/6c19acb760f4991abc4863c481841d8f/2025-08/w_1.jpg",
    "sponsored": false,
    "id": "c11287b6b5365397"
  },
  {
    "source": "TheStandard",
    "url": "https://www.thestandard.com.hk/world-news/article/308443/US-federal-court-filing-system-breached-in-sweeping-cyberattack-Politico-reports",
    "headline": "US federal court filing system breached in sweeping cyberattack, Politico reports",
    "date": "2025-08-07T12:47:10.000+0800",
    "body": "The U.S. federal judiciary's electronic case filing system has been compromised in a sweeping hack that is believed to have exposed sensitive court data in several states, Politico reported on Wednesday, citing two people with knowledge of the incident.\n\nPolitico said the incident had affected the judiciary's federal case management system, which includes the Case Management/Electronic Case Files, or CM/ECF, which legal professionals use to upload and manage case documents; and Public Access to Court Electronic Records, or PACER, which provides the public with pay- or access to some of the same data.\n\nThe Administrative Office of the U.S. Courts and the Cybersecurity and Infrastructure Security Agency, or CISA, didn't immediately return messages seeking comment late Wednesday. The Federal Bureau of Investigation referred questions to the Justice Department, which did not immediately reply to an email.\n\nPolitico did not say whether any specific entity was suspected of being behind the hack but the case management system - which carries sensitive information such as sealed indictments and arrest warrants - has long been a magnet for foreign spies.\n\nIn 2021 the Administrative Office of the U.S. Courts said it was adding new security procedures to protect confidential or sealed records following an apparent compromise of the system.\n\nThe following year, then-House Judiciary Chairman Jerry Nadler said that \"three hostile foreign actors\" had targeted the courts' document filing system and that there had been a breach of \"startling breadth and scope.\"\n\nThe federal judiciary has struggled to modernize its aging systems. Earlier this year, U.S. Circuit Judge Amy St. Eve told lawmakers that years of underinvestment had left the judiciary system's IT systems vulnerable.\n\n\"Many of them are no longer up to date with modern development standards or security protocols, leaving them expensive to operate, difficult to maintain, and at  regular risk of either operational failure or compromising security breaches,\" she said.\n\nReuters",
    "coverImg": "https://image.hkstandard.com.hk/f/1200p0/0x0/100/none/9dfcf6e012ed064e7e1bca1988965d75/2025-08/c_1.jpg",
    "sponsored": false,
    "id": "939cf3b3872c601a"
  }
]