[
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-29/china-s-social-spending-hits-highest-level-in-nearly-two-decades",
    "pass": "amp",
    "title": "China Social Spending Hits Highest Level in Nearly 2 Decades",
    "date": "2025-07-29T02:40:00.000Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ic4Kp9CtL_HM/v0/1200x800.jpg",
    "content": "China’s government spending has pivoted toward social welfare to a degree unseen for at least a generation, as it runs a record budget deficit with a focus on boosting consumption to cushion the blow from Donald Trump’s tariffs.\n\nThe latest evidence arrived on Monday, when China announced it will start offering nationwide cash handouts to families as an incentive for couples to have children. While Beijing is channeling less on-budget investment into infrastructure, expenditure that covers outlays ranging from education to employment and social security climbed to nearly 5.7 trillion yuan ($795 billion) in the first half  — the highest for the period since the data series began in 2007."
  },
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-29/asian-coal-prices-climb-to-highest-since-february-on-summer-heat",
    "pass": "amp",
    "title": "Asian Coal Prices Climb to Highest Since February on Summer Heat",
    "date": "2025-07-29T04:34:56.017Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iT94T_lm2eR4/v1/1200x800.jpg",
    "content": "Asia’s coal price benchmark rose to a five-month high after hot summer weather boosted demand for air conditioning and reduced brimming inventories.\n\nAustralian Newcastle futures rose to $115.50 per ton, the highest for the front-month contract since February. Coal-fired power generation in Tokyo hit the highest level in 10 months on Friday amid higher-than-normal temperatures. Japan is a major importer of Australian coal."
  },
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-29/china-s-record-breaking-trade-hit-first-big-speed-bump-since-may",
    "pass": "amp",
    "title": "China’s Record-Breaking Trade Hit First Big Speed Bump Since May",
    "date": "2025-07-29T04:28:43.556Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ik2nXX57lEoc/v0/1200x800.jpg",
    "content": "China’s trade had its worst week in almost three months, a sign this year’s record-breaking volumes may be starting to slow.\n\nCargo throughput at the nation’s ports was 6.2 million containers last week, according to data released Monday by the Ministry of Transport. That was the lowest since the second week in May and a drop of almost 7% from the previous week, according to the statement."
  },
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-29/china-s-coal-pipeline-risks-creating-glut-blowing-climate-goals",
    "pass": "amp",
    "title": "China’s Coal Pipeline Risks Creating Glut, Blowing Climate Goals",
    "date": "2025-07-29T00:01:00.000Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/irfMZ8K9kPSk/v1/1200x800.jpg",
    "content": "Globally, 105 million tons of coal production capacity was added in 2024, down 46% from a year earlier and the lowest in at least a decade.\n\nChina’s proposed coal mine developments risk creating an oversupply and derailing climate goals, according to Global Energy Monitor.\n\nMore than 450 sites are in development across China, with nearly 40% under construction or in test operation, according to the California-based researcher, which promotes clean energy use. If they are all built, their combined capacity of 1.35 billion tons a year would surpass that operating in Indonesia and Australia, the biggest exporters of the fuel for power generation and steelmaking."
  },
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-28/china-rolls-out-nationwide-childcare-subsidy-to-boost-birth-rate",
    "pass": "amp",
    "title": "China Rolls Out Childcare Subsidy to Boost Births, Sentiment",
    "date": "2025-07-28T09:11:58.674Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iENdchH2ia_4/v1/1200x800.jpg",
    "content": "Women push baby strollers in Chongqing, China.\n\nPhotographer: Cheng Xin/Getty Images\n\nChina announced that it will start handing out childcare subsidies across the nation, in its latest push to boost birthrates after a worrying drop in recent years.\n\nThe government will spend 3,600 yuan ($502) a year per child under age three, according to the official Xinhua News Agency. The assistance, effective retrospectively from Jan. 1 this year and available regardless of the first-, second- or third-child, is meant as an incentive for young couples wary of rising costs of child-rearing."
  },
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-29/the-hurdles-behind-building-southeast-asia-s-supergrid-for-clean-energy-future",
    "pass": "amp",
    "title": "The Hidden Hurdles Behind Building Southeast Asia's $100 Billion Supergrid",
    "date": "2025-07-29T00:01:55.312Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i5X_hewlYzLk/v1/1200x900.jpg",
    "content": "A project in the mountains of Laos is bringing the region one step closer to a vast, interconnected energy network\n\nMonsoon Wind Power Project in Dak Cheung, Laos, in June.\n\nThe hardest part of building a wind farm along the misty ridges of southern Laos wasn’t hauling 25-ton blades up mountain roads or laying 71 kilometers (44 miles) of cables in thick vegetation. It wasn’t even removing unexploded bombs left over from the Vietnam War.\n\nInstead, it was bureaucracy that kept engineering veteran Nat Hutanuwatr up at night — the delicate diplomacy and seemingly endless paperwork required for neighboring Southeast Asian nations to share clean electricity. It was, he says, like “climbing a series of Everests.”"
  },
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-28/mcdonald-s-seeks-to-sell-153-million-in-hong-kong-store-space",
    "pass": "amp",
    "title": "McDonald’s to Sell $153 Million in Hong Kong Store Space",
    "date": "2025-07-28T03:51:06.290Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/izAtOEbHWOZ8/v0/1200x800.jpg",
    "content": "McDonald’s Corp. is marketing eight of its retail properties in Hong Kong valued at HK$1.2 billion ($153 million), at a time when the real estate market in the city remains weak.\n\nThe fast food chain is offloading the shops located in major shopping districts including Tsim Sha Tsui and Causeway Bay while keeping the leases, property agency JLL, which was appointed to handle the tender, said in a statement on Monday."
  },
  {
    "url": "https://www.bloomberg.com/news/articles/2025-07-28/china-probes-celebrity-monk-over-embezzlement-sex-misconduct",
    "pass": "amp",
    "title": "China Probes Celebrity Monk for Embezzlement, Sex Misconduct",
    "date": "2025-07-28T03:32:08.036Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/icyRXesoHbLE/v0/1200x800.jpg",
    "content": "China has accused the former head monk of its most famous Buddhist temple of embezzling funds and sexual misconduct, beginning a new investigation more than a decade after similar allegations surfaced.\n\nShi Yongxin, the abbot of the Shaolin Temple until he lost his ordination, is under probe for allegedly misappropriating temple assets, the 1,500-year-old monastery said in a notice on its official WeChat account on Sunday. The institution also accused Yongxin of violating Buddhist precepts by having long-term relationships with several women and fathering illegitimate children."
  }
]